{"domain": "https://cointelegraph.com", "title": "Bitcoin 'Mild Danger Zone' As Profit-Taking Is A Possibility", "text": "Crypto analysts said in market reports this week that while Bitcoin’s overvaluation metric isn’t at extreme historical levels, it sits in a “mild danger zone” just days after Bitcoin reached new all-time highs.", "authors": "Cointelegraph", "published": "2025-08-19T02:23:15Z", "url": "https://cointelegraph.com/news/bitcoin-price-danger-zone-consolidation-profit-takers-analysts", "source": "gnews_fallback", "error": "Failed to download"}
{"domain": "https://cointelegraph.com", "title": "Google Becomes Largest Shareholder in TeraWulf", "text": "Google now has a 14% stake in TeraWulf, after receiving more stock in exchange for increasing its backstop in a deal between the Bitcoin miner and Fluidstack.", "authors": "Cointelegraph", "published": "2025-08-19T03:26:08Z", "url": "https://cointelegraph.com/news/google-largest-shareholder-terawulf-ai-data-center-fluidstack", "source": "gnews_fallback", "error": "Failed to download"}
{"domain": "https://cointelegraph.com", "title": "Bitcoin Profit Taking Ramps Up But Bulls Buy The Dip", "text": "Bitcoin profit-taking and sharp liquidations are normal after new all-time highs. The good thing is, traders are buying the dip.", "authors": "Cointelegraph", "published": "2025-08-19T00:30:06Z", "url": "https://cointelegraph.com/news/bitcoin-liquidity-zones-swept-but-uptick-in-open-interest-hints-at-btc-recovery", "source": "gnews_fallback", "error": "Failed to download"}
{"domain": "https://cointelegraph.com", "title": "Bitcoin bull and billionaire files for $250M SPAC targeting DeFi, AI", "text": "Tech-focused venture capitalist Chamath Palihapitiya is looking to raise $250 million for a SPAC under American Exceptionalism Acquisition Corp, focused on DeFi, AI and defense.", "authors": "Cointelegraph", "published": "2025-08-19T04:22:42Z", "url": "https://cointelegraph.com/news/billionaire-chamath-palihapitiya-files-250m-spac-targeting-defi-ai", "source": "gnews_fallback", "error": "Failed to download"}
{"domain": "https://crypto.news", "title": "Michael Saylor’s Strategy loosens stock issuance limits", "text": "Michael Saylor’s Strategy loosens stock sale limits to sustain Bitcoin strategy\nMichael Saylor’s Strategy Inc. is adjusting its financing playbook, easing restrictions on stock sales just weeks after pledging tighter rules.\n- Strategy Inc. eased its self-imposed limit on stock issuance, allowing sales even when its shares trade below the 2.5x Bitcoin holdings threshold.\n- The company added 430 BTC last week, bringing total holdings to 629,376 BTC with more than $26 billion in unrealized gains.\n- Despite strong Bitcoin reserves, Strategy’s stock is down 22% since November, raising concerns over dilution and demand for its preferred equity program.\nAccording to an Aug. 18 report by Bloomberg, the change gives the Bitcoin-heavy company greater flexibility to raise funds as its share premium over Bitcoin (BTC) holdings narrows.\nStrategy’s stock issuance rules shift\nPreviously, the company had promised not to issue new shares if its stock traded at less than 2.5 times the value of its Bitcoin holdings, a buffer Saylor termed the “mNAV premium.” That limit was intended to reassure investors concerned about dilution. Exceptions were only allowed to cover debt interest or preferred equity dividends.\nUnder the updated policy, Strategy will permit stock issuance below the 2.5x threshold “when otherwise deemed advantageous to the company.” Analysts like Brian Dobson of Clear Street said the additional language allows Saylor to be more opportunistic in financing Bitcoin purchases.\nThe shift comes as demand for the firm’s preferred stock program, a novel perpetual equity product Saylor unveiled in July, faces uncertainty. Investor appetite has been tested by falling premiums on Strategy’s shares and increasing competition from Bitcoin ETFs and other crypto-treasury firms.\nSlower purchases, strong holdings\nStrategy’s pace of Bitcoin accumulation has moderated. The company disclosed on Aug. 18 that it bought 430 Bitcoin for $51.4 million in the prior week, following a 155 BTC purchase the week before. In total, Strategy now holds 629,376 BTC, acquired at an average price of $73,320. With Bitcoin trading near all-time highs around $119,666, the firm sits on more than $26 billion in unrealized gains.\nDespite these gains, Strategy’s stock has fallen 22% since reaching a record in November, lagging Bitcoin’s 23% rally over the same period. Short sellers like Jim Chanos have questioned whether the firm’s four series of preferred stock offerings can offset reduced at-the-market equity sales.\nThe latest revision shows how quickly Saylor’s bold financing strategy is being tested. While easing restrictions may reassure the company’s ability to keep building its Bitcoin reserves, it also highlights investor concerns about dilution and long-term sustainability.", "authors": "Crypto News", "published": "2025-08-19T05:03:22Z", "url": "https://crypto.news/michael-saylor-strategy-stock-sale-limits-bitcoin-2025/", "source": "trafilatura"}
{"domain": "https://www.benzinga.com", "title": "Bitcoin, Ethereum, Dogecoin, XRP Slide As Crypto Liquidations Top $500 Million: Analyst Says This Is What Is In Store For BTC In The Current Quarter", "text": "Leading cryptocurrencies fell further, while stocks barely changed on Monday as investors trimmed risk appetite.\n| Cryptocurrency | Gains +/- | Price (Recorded at 9:20 p.m. ET) |\n|---|---|---|\n| Bitcoin BTC/USD | -0.81% | $116,487.79 |\n| Ethereum ETH/USD | -2.77% | $4,339.70 |\n| XRP XRP/USD | -0.15% | $3.07 |\n| Solana SOL/USD | -2.50% | $185.09 |\n| Dogecoin DOGE/USD | -3.37% | $0.2244 |\nMore Than $400 Million In Longs Liquidated\nBitcoin sank below $115,000 early morning but recovered to above $117,000 by evening. Trading volume jumped nearly 50% over the last 24 hours.\nEthereum also rebounded to $4,400, but the rally could not be sustained, pushing the coin back to the early $4,300s overnight. XRP and Solana fell 0.15% and 2.50%, respectively.\nETH's dominance rose to 13.3%, while Bitcoin's market share dropped below 59%.\nOver $535 million was liquidated from the market over the last 24 hours, with long positions accounting for $436 million. Around $422 million in BTC longs risk liquidation if the coin slips below $114,000.\nBitcoin's open interest fell 1.24% over the last 24 hours. Meanwhile, over 57% of Binance traders with open BTC positions were betting in favor of the coin's rally.\nThe \"Greed\" sentiment dropped further to 56, according to the Crypto Fear & Greed Index, signaling an increase in selling pressure.\nTop Gainers (24 Hours)\n| Cryptocurrency | Gains +/- | Price (Recorded at 9:20 p.m. ET) |\n|---|---|---|\n| AB (AB) | +7.52% | $0.009614 |\n| OKB (OKB) | +5.27% | $123.01 |\n| POL (POL) | +3.18% | $0.2559 |\nThe global cryptocurrency market capitalization stood at $4.02 trillion, following a decline of 3.87% in the last 24 hours.\nAll Eyes On Jerome Powell\nStocks were little changed on Monday. The Dow Jones Industrial Average fell 34.30 points, or 0.08%, to close at 44,911.82. The S&P 500 dipped 0.01% to close at 6,449.15. The Nasdaq Composite was the outlier, closing up 0.03% at 21,629.77.\nInvestors are looking forward to Federal Reserve Chair Jerome Powell’s speech at the Jackson Hole Economic Policy Symposium on Friday for signals on monetary policy.\nTraders are pricing in an 83% chance that the central bank cuts interest rates at its September meeting, according to the CME FedWatch tool.\nWill Whale Accumulation Power Bitcoin Up?\nOn-chain analytics firm Santiment stated that Bitcoin whales have been accumulating since the dip from last week's all-time high.\n\"With prices -6.22% since August 13th, wallets with 10-10,000 BTC have accumulated 20,061 more coins,\" Santiment added.\nThe firm indicated a \"notable correlation\" between the cohort's holdings and BTC's future price movement.\nWidely followed cryptocurrency analyst BitBull highlighted the \"worst case scenario\" for the apex cryptocurrency\n\"It’ll continue to consolidate between $112,000-$120,000 in Q3, while alts will head higher. We could even see a capitulation wick below $112,000, just like we had a pump above $124,000,\" the analyst projected.\nPhoto Courtesy: Volodymyr Maksymchuk on Shutterstock.com\nRead Next:\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "authors": "Benzinga", "published": "2025-08-19T02:06:30Z", "url": "https://www.benzinga.com/crypto/cryptocurrency/25/08/47200095/bitcoin-ethereum-dogecoin-xrp-slide-as-crypto-liquidations-top-500-million-analyst-says-this-is-what-is-in-store-for-btc-in-the-current-quarter", "source": "trafilatura"}
{"domain": "https://www.activistpost.com", "title": "Metaplanet to Launch Preferred Shares, Bitcoin-Backed Yield Curve Plan", "text": "Metaplanet to Launch Preferred Shares, Bitcoin-Backed Yield Curve Plan\nJapan’s largest public bitcoin holder aims to expand its treasury operations and integrate BTC into the country’s fixed income markets.\nWhat to know:\n- New perpetual preferred equity instrument, “Metaplanet Prefs,” will fund BTC acquisitions and enable issuance of BTC-backed credit products.\n- Company plans to develop a bitcoin-backed yield curve to price BTC-collateralized instruments for Japanese institutional investors.\nTokyo-based investment firm Metaplanet (3350) has unveiled two major strategic initiatives aimed at deepening its integration of bitcoin.\nThe announcements came as the company posted strong second-quarter results, with revenue climbing 41% quarter-over-quarter to 1.239 billion yen ($8.4 million) and net income swinging to a 11.1 billion yen ($75.1 million) profit from a 5.0 billion loss yen last year.\nMetaplanet’s head of bitcoin strategy Dylan LeClair announced the launch of “Metaplanet Prefs,” a perpetual preferred equity instrument designed to scale the company’s bitcoin treasury operations similar to Strategy’s (MSTR) preferred equities.\nAs Japan’s largest publicly traded bitcoin holder, Metaplanet intends to set a new standard in the country’s fixed income market by introducing BTC-backed credit products through these preferred shares.\nAccording to the Metaplanet, the preferred shares will allow for the issuance of BTC-backed instruments across a wide range of credit profiles and maturities. The goal is to align with and adapt to domestic fixed income demand, positioning bitcoin as a credible form of collateral in Japan’s capital markets.\nThe second initiative involves building a bitcoin-backed yield curve in the Japanese fixed income market. This would create a framework for pricing BTC-collateralized credit instruments, offering institutional investors a new way to gain exposure to Bitcoin while generating predictable yields.\nAs of mid-August, Metaplanet holds 18,113 BTC worth about $1.85 billion, making it the sixth largest corporate bitcoin holder in the world. Metaplanet shares are down about 50% from all-time highs, but remain 10% above recent lows.\nRead more: Metaplanet Boosts Bitcoin Reserves With $61M Purchase", "authors": "Activist Post", "published": "2025-08-19T00:00:00Z", "url": "https://www.activistpost.com/metaplanet-to-launch-preferred-shares-bitcoin-backed-yield-curve-plan/", "source": "trafilatura"}
{"domain": "https://decrypt.co", "title": "SEC Punts on Trump Media Bitcoin and Ethereum ETF Decision, Plus XRP and Dogecoin Funds", "text": "In brief\n- The SEC will decide on the Truth Social Bitcoin and Ethereum ETF on October 8, likely after a rules change request from two exchanges that could shorten approval processes.\n- The agency delayed decisions on XRP funds from Grayscale, Bitwise, CoinShares, Canary Capital, and 21Shares.\n- It also pushed back deadlines on separate Dogecoin and Litecoin ETFs, and a proposal to add staking to an existing spot Ethereum ETF.\nThe U.S. Securities and Exchange Commission has delayed its decisions on an exchange-traded fund proposed by Donald Trump's media and technology company to track the performance of Bitcoin and Ethereum and seven other ETFs based on single digital assets.\nIn a filing Monday, the regulator said that it moved its deadline back 45 days for weighing in on the Truth Social Bitcoin and Ethereum ETF to October 8.\nIt announced identical delays for applications filed for spot XRP funds by Grayscale, CoinShares, Canary Capital, Bitwise and 21Shares, a spot Dogecoin ETF from Grayscale, and a spot Litecoin product from CoinShares, although the dates for potential approvals of those funds vary.\nIt also held up resolving a request to add staking to the the 21Shares Core Ethereum ETF, which tracks the price of the second-largest cryptocurrency by market value.\nThe delays comes four days after the agency delayed decisions on Solana ETFs from Bitwise, 21Shares, and VanEck, and a Dogecoin fund from 21Shares.\nThe SEC is weighing a wave of proposals tracking cryptocurrencies. Those submissions have resulted from the dramatic success of 11 spot Bitcoin and nine Ethereum ETFs, a more favorable political environment for cryptocurrencies ushered in by the Trump administration, and growing interest by traditional finance giants who were formerly resistant to the asset.\nThe filings also follow roughly three weeks after two major U.S. exchanges asked the SEC to approve amendments that could significantly shorten the approval process for future crypto exchange-traded funds, automatically listing certain products without requiring case-by-case filings.\nIn separate filings, Cboe BZX and NYSE Arca requested changes to their listing standards that would allow certain crypto ETFs to be listed without enduring the SEC's rigorous evaluation under Rule 19b-4, a process that requires exchanges to submit proposed rule changes. Under current guidelines, such reviews of proposed changes to funds could take 240 days.\nBloomberg Senior ETF Analyst Eric Balchunas told Decrypt that the SEC's filings Monday were \"nothing significant,\" and were likely timed to follow a probable SEC green light of Cboe and NYSE's amendments next month following the conclusion of a comments period.\n\"Even though it feels like 'Isn't this SEC supposed to approve all this stuff?', the listing standards are out for comment,\" Balchunas said. \"So just in the nick of time, these listing standards should be approved. And then we're anticipating a batch of approvals based on the listing standard starting in October.\"\n\"So this delay feels discouraging, but it's just a little more patience,\" he added. \"It'll all happen soon.\"", "authors": "Decrypt", "published": "2025-08-19T01:31:04Z", "url": "https://decrypt.co/335695/sec-punts-trump-media-bitcoin-ethereum-etf-decision-xrp-dogecoin", "source": "trafilatura"}
{"domain": "https://decrypt.co", "title": "Bitcoin Treasury KindlyMD Closes $200 Million Raise to Buy More BTC", "text": "In brief\n- KindlyMD said it was merging with Nakamoto Holdings to become a Bitcoin treasury back in May.\n- The company just closed a $200 million convertible note offering.\n- KindlyMD is the latest firm to pivot to Bitcoin buying as a way to provide better returns for investors.\nBitcoin treasury KindlyMD has closed a $200 million convertible note offering that it will use to buy more BTC, the company announced Monday.\nThe issuance is the latest step in the company's strategy to build its BTC holdings and adds to the $540 million that the company raised via a private placement in public equity (PIPE), which closed concurrently as it merged with Nakamoto Holdings. The combine company is retaining the KindlyMD name.\n\"The Company intends to use the net proceeds from the Convertible Note offering to purchase more Bitcoin, as well as for working capital and general corporate purposes,\" KindlyMD said in a statement Friday.\nUPDATE: KindlyMD Closes $200 Million Convertible Note Offering. The issuance of the Convertible Note expands our Bitcoin treasury strategy and adds to the $540M gross proceeds from the PIPE Financing.\n— Nakamoto (@nakamoto) August 15, 2025\nIn May, Kindly, which has shifted its focus as a healthcare data provider, and Nakamoto Holdings announced their merger. Nakamoto is a holding company co-founded by Bitcoin Magazine CEO David Bailey, with the intent of purchasing Bitcoin. CEO Bailey advised President Trump on his 2024 crypto policy while the Republican was campaigning.\nYA II PN, Ltd., an investment fund managed by hedge fund Yorkville Advisors, is managing the financing.\nKindlyMD's stock, which trades on the Nasdaq under the ticker NAKA, closed about 12% lower on Monday. The idea is that investors will be able to get exposure to the leading cryptocurrency by buying its stock.\nA full 168 public companies have Bitcoin treasuries—a move popularized by Michael Saylor's software firm Strategy, which began purchasing the asset in 2020.\nAfter pivoting from software development, Strategy started buying Bitcoin in August 2020 as a way to generate better returns for its shareholders.\nIt is the largest corporate holder of the asset with 629,376 BTC worth over $73 billion. It mostly works now to securitize Bitcoin.\nBitcoin was recently trading for $116,605 per coin after dropping 1% over a 24-hour period. It broke a new all-time high last week of $124,128, according to crypto data provider CoinGecko.\nStrategy issues debt to fund its purchases. Since Strategy first bought Bitcoin five years ago, its stock (Nasdaq: MSTR) has rocketed up by over 2,700%.\nSome of Strategy's followers are using spare cash to buy the flagship digital currency, while others are issuing debt.\nBut some experts have warned that the crypto play has its risks.\nOther notable treasuries include Twenty One, started by a combination of crypto and traditional finance powerhouses—Tether, Bitfinex, Cantor Fitzgerald, and SoftBank. It holds 43,500 digital coins, although it has yet to begin trading.", "authors": "Decrypt", "published": "2025-08-18T22:11:44Z", "url": "https://decrypt.co/335709/bitcoin-treasury-kindlymd-closes-200m-raise-buy-btc", "source": "trafilatura"}
{"domain": "https://economictimes.indiatimes.com", "title": "Bitcoin drops by nearly 4% to $114K in one week. Experts hint at consolidation phase", "text": "Bitcoin fell nearly 4% in a week to around $114K, consolidating below $116K on macro headwinds. Analysts say rising open interest near $115K could provide short-term support unless demand weakens.", "authors": "Economic Times", "published": "2025-08-19T05:37:00Z", "url": "https://economictimes.indiatimes.com/markets/cryptocurrency/bitcoin-drops-by-nearly-4-to-114k-in-one-week-experts-hint-at-consolidation-phase/articleshow/123378918.cms", "source": "gnews_fallback", "error": "Failed to download"}
