{"domain": "https://www.reuters.com", "title": "Japan must raise rates, get fiscal house in order, says veteran lawmaker Kono", "text": "Japan must raise interest rates and get its fiscal house in order to strengthen a weak yen that has pushed up inflation and brought pain to households, veteran ruling party lawmaker Taro Kono told Reuters on Tuesday.", "authors": "Reuters", "published": "2025-08-19T04:23:35Z", "url": "https://www.reuters.com/business/japan-must-raise-rates-get-fiscal-house-order-says-veteran-lawmaker-kono-2025-08-19/", "source": "gnews_fallback", "error": "Failed to download"}
{"domain": "https://www.livemint.com", "title": "US must ‘crush’ Russian economy by penalising countries buying oil from them: Trump aide", "text": "United States Senator Lindsey Graham, an aide to Donald Trump, has advised that the US should 'crush' the Russian economy by imposing penalties on countries that purchase oil from them.\nIf this were to happen, the move would directly affect India, which is a significant buyer of Russian crude.\nIn a post on X, Graham stated, “My advice to President Donald Trump and Secretary of State Marco Rubio is to convince Putin that if this war does not come to an end, we will crush the Russian economy by going after countries that buy their cheap oil and gas.”\nGraham's comments appear to conflict with those of Russian President Vladimir Putin, who said during a press conference with Trump in Alaska on 15 August that bilateral trade between the two nations had increased by 20% since Trump's reinstatement as President.\n\"Russia and the US can offer each other so much in trade, digital, high-tech, and in space exploration. We see that Arctic cooperation is also very possible in our international context, for example, between the far east of Russia and the west coast of the US. Overall, it's very important for our countries to turn the page, to go back to cooperation,\" Russian President Putin said.\nThe comments came as Trump said in an interview with Fox News that Russia had lost India as an oil client. He made this statement while discussing the economic aspect of Russian President Vladimir Putin coming to the table for talks, ANI reported.\n\"Well, they lost an oil client so to speak, which is India, which was doing about 40% of the oil, China as you know is doing a lot...and If I did secondary sanctions, it would be devastating from their standpoint. If I have to do it, I'll do it, maybe I won't have to do it,\" Trump said during the interview.\nTrump's comments follow his recent imposition of a 50% tariff on Indian imports, citing New Delhi's crude oil purchases from Russia.\nStay updated with the latest Trending, India , World and US news. Celebrate the spirit of Independence Day 2025 by exploring live updates and key moments from the 79th Independence Day celebrations in India. Complement your patriotic mood by sharing heartfelt wishes, quotes, and images for a Happy 79th Independence Day with loved ones.", "authors": "Livemint", "published": "2025-08-19T04:04:24Z", "url": "https://www.livemint.com/news/world/us-must-crush-russian-economy-by-penalising-countries-buying-oil-from-them-trump-aide-11755574767796.html", "source": "trafilatura"}
{"domain": "https://www.livemint.com", "title": "IIM Calcutta and Emeritus Commence ‘CFO Programme’, Addressing Growing Demand for Multi-Dimensional Finance Leadership", "text": "Mumbai, Maharashtra, India – Business Wire India\nAs the CFO role expands beyond finance, today’s financial leaders are expected to drive enterprise-wide strategy, lead innovation, unlock long-term value, and manage cross-functional priorities. According to Gartner’s Top 5 Priorities for CFOs in 2025, over 70% of CFOs now shoulder responsibilities outside of core finance, while nearly 50% acknowledge the need for a significant or complete overhaul of their finance leadership teams. In response to this urgent need for multidimensional financial leaders who can navigate complexity and drive transformation, IIM Calcutta, one of the leading B-schools in India, ranked 1st by BT-MDRA, 2024, has commenced the Chief Financial Officer (CFO) Programme in partnership with Emeritus.\nBacked by Triple Crown accreditation (AMBA, EQUIS, AACSB), the institute is widely recognised for its academic strength in analytics and digital transformation. This skill-driven programme is ideally suited for new and emerging CFOs aiming to lead innovative financial strategies, sharpen their competitive edge, and drive sustainable business value. It is also well-suited for senior professionals aspiring to step into the CFO role or other key financial leadership positions. Additionally, the programme is tailored for business heads, CXOs, and financial leaders who are at the forefront of driving strategic financial decision-making within their organisations.\nSpeaking on the programme, Avnish Singhal, Executive Vice President, India & APAC Emeritus, said, “The future of finance leadership demands more than technical expertise—it calls for a growth mindset, strategic clarity, and global fluency. With this programme, participants will not only strengthen their financial leadership but also build the adaptability required to thrive in shifting business environments.”\nThe Chief Financial Officer Programme, designed and delivered by esteemed IIM Calcutta faculty, offers a strategic blend of academic rigour and real-world application. The 9-month learning journey includes 100 hours of immersive learning through live online sessions, an opportunity to network and experience in-person learning with faculty and peers during the 7-day campus immersion across 2 visits, as well as case studies, simulations, and a capstone project for hands-on learning. Participants will gain a deep understanding of the modern CFO role and responsibilities through live learning under the guidance of renowned IIMC faculty - Prof. Sudhir S. Jaiswall and Prof. Arpita Ghosh.\nThe high-impact curriculum includes new-age topics such as design thinking, digital transformation, ESG, and corporate governance alongside core CFO competencies. This programme also provides participants with access to a robust network of over 300+ finance leaders across the country.\nLearning outcomes of this programme include:\nProgramme Details:\nFor more information, visit the programme page here.\nAbout IIM Calcutta:\nThe Indian Institute of Management Calcutta (IIM Calcutta) was established as the first national institute for post-graduate studies and Research in Management by the Government of India in November 1961 in collaboration with Alfred P. Sloan School of Management (MIT), the Government of West Bengal, the Ford Foundation, and Indian industry. During its initial years, several prominent faculties formed part of its nucleus, including Jagdish Sheth, J. K. Sengupta, among others. Over the years, IIM Calcutta has grown into a mature Institution with a global reputation, imparting high-quality management education.\nAbout Emeritus:\nEmeritus offers customised and open programs in India, Singapore, Dubai and other global locations in collaboration with IIM Lucknow Executive Education, IIM Calcutta Executive Education, ISB Executive Education, Harvard Business School (HBS), MIT Sloan, Columbia Business School, Kellogg Executive Education, Berkeley Executive Education, and Wharton Executive Education, amongst other leading Institutions. The Emeritus Group has more than 1,750 employees globally and offices in Mumbai, New Delhi, Shanghai, Singapore, Palo Alto, Mexico City, New York, Boston, London, and Dubai. The company is backed by the Chan Zuckerberg Initiative, Leeds Illuminate, Prosus Ventures, GSV Ventures, Peak XV, Bertelsmann, CPPIB, Accel, and SoftBank Vision Fund 2. For more information, please visit https://emeritus.org/\nMedia Contact Details\nRitika Kar | ritika.kar@adfactorspr.com | 9711306380\nNote to the Reader: This article is part of Mint's promotional consumer connect initiative and is independently created by the brand. Mint assumes no editorial responsibility for the content.\nCatch all the Business News, Market News, Breaking News Events and Latest News Updates on Live Mint. Download The Mint News App to get Daily Market Updates.", "authors": "Livemint", "published": "2025-08-19T05:43:45Z", "url": "https://www.livemint.com/brand-stories/iim-calcutta-and-emeritus-commence-cfo-programme-addressing-growing-demand-for-multi-dimensional-finance-leadership-11755510152252.html", "source": "trafilatura"}
{"domain": "https://theprint.in", "title": "India needs to talk about over-tourism", "text": "In 2024, travel and tourism contributed around $10.9 trillion to global GDP, accounting for 10 per cent of the world economy. The sector also supports 35.7 crore jobs worldwide, providing a major boost to employment. Domestically, tourism contributes about 6-7 per cent to India’s GDP and sustains the economies of several regions. It is thus a strong pillar of both the domestic and global economy.\nTravel and exploration, fuelled by human imagination, are protected under the fundamental right to freedom of movement. Moreover, tourism fosters community development by prompting the expansion of hospitals and public amenities, while also keeping cultures, cuisines, handicrafts, and traditions alive. Recent geopolitical events involving the Maldives and Lakshadweep have highlighted tourism’s role as a powerful instrument of soft power, playing a strategic part in diplomatic relations.\nYet a crucial question arises: What happens when one citizen’s right to travel begins to infringe upon another’s right to life and liberty? This question lies at the heart of the over-tourism debate. When tourism surges, visitor numbers overwhelm natural ecosystems, strain public infrastructure, and erode local quality of life. The debate often swings between extremes, but without scientific measures, it risks distracting from the real challenges facing global tourism.\nConsider these two examples. The Great Smoky Mountains in the US are degrading year after year under pressure from trailers, hikers, and waste. Thailand’s Maya Bay was closed in 2018 due to threats to coral reefs. Both these cases tell a sad story — of beautiful, natural, and cultural creations turned into spectacles of entertainment and thrill to fuel human adrenaline.\nAlso read: No one should have to choose between a roof and two meals. But India’s migrants do, every day\n‘Too many tourists, too little space’\nThe global population is projected to surpass 8.2 billion in 2025, which is one of the reasons behind the increase in tourism. International tourist arrivals have already surpassed pre-pandemic levels, with 2025 on track for a record high. India, often at the centre of overpopulation debates, faces renewed concerns about stress on resources in the post-pandemic period. The pandemic intensified discussions around equitable distribution of resources rather than sheer numbers.\nOver-tourism has become a global axiom, raising concerns about environmental damage, climate change, community displacement, cultural dilution, and price inflation. Venice is sinking under the weight of cruise ships and tourist crowds.\nWho bears the brunt? The native residents.\nWhy should local communities suffer in order to facilitate someone else’s adventures?\nAlso read: The curious India tourism paradox. Domestic pilgrims opt for luxury, foreigners go budget\nImpact of excessive tourism\nThis issue is not confined to developed countries; developing nations also face severe consequences. Travellers don’t just go to top global destinations; they are also drawn to natural beauty, hospitality, and safety. For example, the Galapagos Islands, a small archipelago in Ecuador, host more than 3 lakh people during peak season, which is now threatening endangered flora.\nA major impact of excessive tourism is ecological strain. Fragile ecosystems degrade, while air, water, and noise pollution rise. Small communities are impacted by strain on their resources. Waste generation pollutes oceans, and heritage sites — from the Taj Mahal to Machu Picchu — are wearing out due to tourism and air pollution.\nThe impacts are also visible on the lives of native residents. Housing pressure increases as landlords, blinded by short-rentals of high-paying tourists, refuse long leases to locals, pushing them out of city centres. Families are uprooted and forced to build lives elsewhere.\nThe trickle-down effects reach the economy, society, and industry. While travel, hospitality, and local markets undoubtedly thrive, the environment and residents pay the price. Landslides, flash floods, droughts, and famines are all visible effects of over-tourism. Landslides in Mussoorie and Nainital, the imposition of green tax in Manali, and recent floods in Mandi all bear testimony.\nEven global hotspots like Barcelona and Santorini are facing the heat. Several tourists arrive at the same time and engage in similar activities — cruising, boating, shopping — overloading ecosystems. Rentals spike, and essential shops like groceries and laundries vanish, replaced by souvenir stalls and bike rentals.\nIn India, Coorg and Wayanad face similar struggles during peak seasons. Coorg, known for its coffee and landscapes, bears the brunt of over-tourism. Homestays and resorts are putting huge pressure on ecology, resources, and local residents. “Local farmers, like me, now face severe water shortages. The region is in drought, which has been exacerbated by the tourism boom. The government is dormant regarding this situation,” said Anushka, a coffee farmer.\nAlso read: Can you limit the negative impact of tourism? Here are 4 ways\nManaging and mitigating\nWith the burden on Earth’s resources increasing, solutions are imminent and necessary. Primarily, governments can issue passes and e-permits to limit tourist inflows, restrict access to fragile areas such as trekking trails, lakes, and national parks, and promote lesser-known destinations to ease pressure. Price regulation for goods and rentals would go a long way in safeguarding local residents’ well-being. Permit systems, advance booking, and restrictions on caps on daily visitors — as seen in the Galapagos — are effective measures.\nClimate-conscious steps like building sustainable walkways, recyclable products, and makeshift infrastructure can also be implemented for key events, festivals, and gatherings, much like arrangements at the Kumbh Mela.\nGovernment action should be complemented by private and industrial sectors. Dynamic pricing and peak pricing can spread demand across longer periods. Ultimately, this is a cumulative issue being faced by people all over the world and requires a sustained cumulative action by all stakeholders.\nThe issue lies on the intersection of the right to travel and the right to life and liberty. If over-tourism is left unchecked, then the world’s greatest asset would become its greatest liability. The line between economic growth and environmental and cultural preservation is thin. Progress on both fronts is necessary, but not at the cost of either. Tourism should be a bridge between cultures, not a weight that sinks the very shores it seeks to admire.\nKarti P Chidambaram is a Member of Parliament for Sivaganga, and a Member of the All India Congress Committee. His X handle is @KartiPC. Views are personal.\n(Edited by Prashant)", "authors": "ThePrint", "published": "2025-08-19T05:30:51Z", "url": "https://theprint.in/opinion/india-needs-to-talk-about-over-tourism-before-the-great-asset-becomes-the-greatest-liability/2723891/", "source": "trafilatura"}
{"domain": "https://www.bloomberg.com", "title": "UK Job Weakness Should Worry BOE More Than Inflation", "text": "The British government should consider broadening the central bank’s mandate to take the labor market into account when setting monetary policy.", "authors": "Bloomberg", "published": "2025-08-19T04:00:30Z", "url": "https://www.bloomberg.com/opinion/articles/2025-08-19/uk-job-weakness-should-worry-boe-at-jackson-hole-more-than-inflation", "source": "gnews_fallback", "error": "Failed to download"}
{"domain": "https://www.perthnow.com.au", "title": "Premier Roger Cook insists new Productivity Commission will give WA agility in a fast-changing world", "text": "Premier Roger Cook insists new Productivity Commission will give WA agility in a fast-changing world\nRoger Cook says the State’s new Productivity Commission will help WA develop its economy along with the rest of the world.\nSpeaking at a breakfast on day three of the Resources Technology Showcase 2025 at the Perth Convention and Exhibition Centre on Tuesday, the Premier said the commission would give “agility in a changing world”.\n“Like any resources company worth their salt, an effective research and development program is a core part of remaining ahead of the pack,” he said.\n“The Productivity Commission will be a version of that for the Government.\n“It will be formed by merging the incredible capabilities of Infrastructure WA together with the Economic Regulatory Authority, and it will have a remit to provide advice and recommendations to government on how Western Australia can remain the best economy in the country.\n“It will mean greater agility in a changing world. It will support continuous improvement for public sector, for the public and private sectors, and it will give us the innovative clout that we need to fully grasp the opportunities ahead of us.”\nMr Cook said that he expected legislation to be introduced to Parliament in the first half of 2026 to establish the commission’s “objectives, responsibilities and governance”.\nThe move was welcomed by Chamber of Commerce and Industry WA acting chief executive Aaron Morey.\n“We’re on the brink of a new era for our economy in WA with huge opportunities to diversify into areas like critical minerals, data centres, defence and advanced manufacturing,” he said.\n“We’re competing for that investment with the rest of the world. If we want to capture those opportunities, it’s crucial that the settings are right to make sure we lure global investment to this State.”\nSpeaking to the conference, Mr Cook reiterated the importance of infrastructure spend to lower carbon emissions.\n“Despite all these advancements in mining, despite having robots and automated gadgets operating in some of the toughest conditions known to humankind, we still don’t have the necessary infrastructure required to power our mines on the latest and greatest energy systems,” he said.\n“Poles and wires may not sound sexy, especially at a showcase about mining technology, poles and wires are hardly the best innovation, the latest, but the sexiness is in what they will achieve.\n“The Pilbara’s network of mines largely run on fossil fuels, as a result, the Pilbara contributes around 40 per cent of the state’s emissions.\n“Eliminating those emissions will not only make the Pilbara the most sustainable mining precinct in the world, it will also take out a huge chunk of state and national emissions.”", "authors": "PerthNow", "published": "2025-08-19T05:28:41Z", "url": "https://www.perthnow.com.au/news/politics/state-politics/premier-roger-cook-insists-new-productivity-commission-will-give-wa-agility-in-a-fast-changing-world-c-19728574", "source": "trafilatura"}
{"domain": "https://www.nation.com.pk", "title": "Finance minister for realising potential of capital market", "text": "KARACHI - Federal Minister for Finance and Revenue Senator Mohammad Aurangzeb has stressed the need for realizing the potential of capital market for the macro-economic sustainable growth in the country.\nWhile addressing a Consultative Workshop ‘Unlocking Capital Market Potential for Banks’ organized by the Securities and Exchange Commission of Pakistan (SECP) and Pakistan Banks Association (PBA) at a local hotel here on Monday, he suggested the participants of the workshop that a Capital Market Development Council should be established to properly run the capital related affairs.\nFinance Minister Mohammad Aurangzeb, speaking about the tax policy, said that now it would be laid down by the Finance Ministry, for the next financial year 2026, instead of Federal Bureau of Revenue (FBR). He said that the tariff policy had been announced by the government and tariff-related reforms were home-grown agenda of the government. He said it was important how we were moving from stability to sustainable growth.\nHe said that the country was moving in the right direction and making measures to achieve its goals. Aurangzeb, lauding the State Bank of Pakistan (SBP) reforms, said that they were very important and the private sector had to lead this country. Later, talking to media persons, he said that Pakistan came out of Financial Action Task Force (FATF) grey list and she would stay out of it. Replying to a question on exchange rate, he said that the government did not have any strategy on it and that was the SBP, which formulate exchange policy. Replying to another question, he said that they were in ongoing conversation with International Monetary Fund (IMF).\nAnswering a question, he said that climate change, and population growth challenges to be addressed to reach where we want to be in 2047. He further said that without dealing and negotiating with these two existential threats we would not be able to make our way into where we want to be in 2047. To another question regarding floods in Khyber-Pakhtunkhwa, the minister said that he could not say about the estimate of losses at this stage because rescue and relief work was still underway.\nGovernor State Bank of Pakistan (SBP) Jameel Ahmad, earlier speaking to the participants of the workshop, underscored the importance of well-developed, deep and diversified capital markets to complement the banking sector and support long-term, sustainable economic growth. He noted that while macroeconomic conditions have improved with inflation falling and growth gradually recovering structural challenges such as low domestic savings persist. With a savings rate of just 7.4 percent of GDP, compared to 27 percent in South Asia, country remains overly reliant on external financing, contributing to recurring external account pressures and boom-bust cycles, he said. Ahmad emphasized the importance of robust capital markets in channeling domestic savings into productive sectors. He noted that well-developed, deep and diversified capital markets, complemented by a resilient banking system, are needed to support sustainable economic development of the economy.\nThe governor outlined recent SBP reforms aimed at broadening participation in the country’s bond market, including the inclusion of non-bank institutions as Special Purpose Primary Dealers and expansion of Investor Portfolio Securities (IPS) accounts to micro-finance banks, the Central Depository Company (CDC) and, the National Clearing Company of Pakistan Limited (NCCPL). These reforms open new investment avenues to millions of digital banking users and lay the foundation for broader market development, he noted. Despite progress in the government bond market, Ahmad expressed concern over the limited development of corporate debt and equity markets. Outstanding corporate bonds account for less than one percent of GDP, with limited secondary market activity and low participation from non-financial sectors. Similarly, equity market penetration remains modest, with investor accounts and market capitalization lagging behind peer economies.\nThe governor concluded by calling for coordinated efforts among regulators, financial organizations, government institutions and investors to promote financial literacy, expand participation, and build a transparent, innovation-friendly market ecosystem.\nChairperson of PSX Dr Shamshad Akhtar, Chairman SECP Akif Saeed, Farrukh Sabzwari, CEO PSX, Presidents, CEOs of banks and other stakeholders were also present on the occasion.", "authors": "The Nation", "published": "2025-08-19T04:49:06Z", "url": "https://www.nation.com.pk/19-Aug-2025/finance-minister-for-realising-potential-of-capital-market", "source": "trafilatura"}
{"domain": "https://wattsupwiththat.com", "title": "UN Plastics Treaty Collapses", "text": "By CFACT Ed\nThe United Nations adjourned its plastics summit in Geneva, Switzerland, with no version of a global treaty coming close to reaching “consensus.”\nThis is great news for the global economy, as radical proposals sought to place taxes and controls on every phase of plastic production and use.\nThe UN plastics summit tried to follow the climate conference script, where launching into late-night overtime is standard. Bleary eyes, however, induced no parties to alter their positions.\nDeveloping nations and the EU were unable to convince manufacturing and petroleum-producing nations to agree on a draft.\nThe anti-plastics nations attempted to kill production via a death by a thousand cuts strategy, by calling for the elimination of important chemicals used in plastics production. The pro-plastics nations saw through the ploy and blocked it.\nPlastics have been a crucial factor in enabling people at every economic level to afford high-quality manufactured goods. They are essential to societal abundance.\nThe ideal solution is to keep plastic in our economies, but to do a great job at managing recycling and waste. Nations with advanced economies have already made huge strides. The vast majority of plastic pollution in the oceans comes from fishing gear and a few rivers in Asia and Africa. Forbidding the use of plastic straws in Paris or Peoria achieves nothing meaningful to combat this waste.\nAs CFACT President Craig Rucker recently wrote, “The real tragedy isn’t plastic itself, but the mismanagement of plastic waste—and the regulatory stranglehold that blocks better solutions. In many countries, recycling is a government-run monopoly with little incentive to innovate. Meanwhile, private-sector entrepreneurs working on advanced recycling, biodegradable materials, and AI-powered sorting systems face burdensome red tape and market distortion.”\nA new UN regime of taxation, mandates, and bans is not the way to deal with the issues surrounding plastics (or pretty much anything else). Working with developing nations to up their recycling and waste management is the way to go.\nDiscover more from Watts Up With That?\nSubscribe to get the latest posts sent to your email.", "authors": "Watts Up With That", "published": "2025-08-19T05:00:00Z", "url": "https://wattsupwiththat.com/2025/08/18/un-plastics-treaty-collapses/", "source": "trafilatura"}
{"domain": "https://economictimes.indiatimes.com", "title": "Inflation, not geopolitics, will guide Fed decisions: Andrew Ferris", "text": "Andrew Ferris, CEO of Ecognosis Advisory, advises clients to reduce US holdings due to expectations that the Federal Reserve will maintain current interest rates. He anticipates Powell will reinforce this stance at the Jackson Hole meeting. Despite the S&P's record high, it's underperforming European and Asian markets.", "authors": "Economic Times", "published": "2025-08-19T05:41:00Z", "url": "https://economictimes.indiatimes.com/markets/expert-view/inflation-not-geopolitics-will-guide-fed-decisions-andrew-ferris/articleshow/123378924.cms", "source": "gnews_fallback", "error": "Failed to download"}
{"domain": "https://economictimes.indiatimes.com", "title": "Little chance of structural downside; FPIs, FIIs FDIs will return to India over next few months: Mayuresh Joshi", "text": "Marketsmith India's Head of Equity, Mayuresh Joshi, expresses optimism about the Indian economy, citing factors like S&P's sovereign rating upgrade and anticipated GST rationalization to boost consumption. He believes strong domestic flows, recovering earnings, and India's favorable position amid global trade uncertainties will attract FPIs and FDIs. Extension of steel safeguard duties is also expected to benefit domestic steel producers.", "authors": "Economic Times", "published": "2025-08-19T04:52:00Z", "url": "https://economictimes.indiatimes.com/markets/expert-view/little-chance-of-structural-downside-fpis-fiis-fdis-will-return-to-india-over-next-few-months-mayuresh-joshi/articleshow/123378076.cms", "source": "gnews_fallback", "error": "Failed to download"}
