{"domain": "https://www.benzinga.com", "title": "ETHZilla Rebrands From 180 Life Sciences, But Stock Sinks 4% In After-Hours Trading: Here's Why", "text": "Shares of the newly branded ETHZilla Corp. ETHZ sank over 4% in Monday's after-hours trading amid a dip in Ethereum ETH/USD, its primary treasury asset.\nETHZ shares are sliding after hours. Get the update here.\nShaky Start For The ETH ‘Proxy’ Stock\nETH fell from $4,380 to $4,290 in the evening, potentially hurting the company’s value, which pivoted to an Ethereum treasury strategy earlier this month.\nA New Chapter For 180 Life Sciences\nETHZilla, formerly 180 Life Sciences Corp., adopted its new brand and began trading under the ticker \"ETHZ,\" according to a press release. The company said it would commit a \"significant\" part of its non-legacy operations to accumulate ETH for its balance sheet.\n“Today, we are embracing our identity as ETHZilla and our commitment to developing a market-leading strategy that seeks to bring the value of Ethereum to investors in the public markets,” said McAndrew Rudisill, Executive Chairman of the company’s board.\nThe firm disclosed holdings of 94,675 ETH at an average acquisition price of $3,902.20, which is currently valued at roughly $406 million, becoming the fifth-largest corporate ETH holder, according to CoinGecko.\nETHZilla completed a $425 million private placement of common stock and pre-funded warrants and a $156.25 million convertible note offering, the proceeds of which will be used to buy more ETH. Billionaire venture capitalist Peter Thiel, through various Founders Fund entities, holds a 7.5% stake totaling 11.59 million shares in the firm.\nThe company said it is working to monetize its legacy biotech intellectual property assets.\nSee Also: Tom Lee’s $5 Billion Ethereum Bet Puts Bitcoin Maximalists On Notice\nPrice Action: At the time of writing, ETH was trading at $4,288.52, down 1.80% over the last 24 hours, according to data from Benzinga Pro.\nETHZilla shares slid 4.18% in after-hours trading after closing 5.26% higher at $7.41 during Monday’s regular trading session.\nAccording to Benzinga’s Edge Stock Rankings, the stock has maintained its positive momentum over the short, medium and long term. Discover how this compares to Strategy Inc. MSTR, the largest cryptocurrency treasury company.\nPhoto Courtesy: Zakharchuk on Shutterstock.com\nRead Next:\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "authors": "Benzinga", "published": "2025-08-19T03:28:55Z", "url": "https://www.benzinga.com/crypto/cryptocurrency/25/08/47200515/ethzilla-rebrands-from-180-life-sciences-but-stock-sinks-4-in-after-hours-trading-heres-why", "source": "trafilatura"}
{"domain": "https://crypto.news", "title": "Starknet v0.14.0 set to go live on mainnet Sep. 1", "text": "Starknet v0.14.0 set to go live on mainnet Sep. 1\nStarknet is preparing to roll out one of its most significant upgrades yet, with version 0.14.0 scheduled for mainnet activation on Sep. 1.\n- Starknet v0.14.0 will activate on Sept. 1, bringing decentralized sequencing, pre-confirmations, and a new fee market.\n- The upgrade introduces faster transaction confirmation times, updated mempool design, and RPC 0.9.0 with improved statuses.\n- Recent developments include the launch of Extended DEX, Bitcoin staking proposals, and a July transition to STRK as the gas token.\nThe update, approved by community vote and confirmed in an Aug. 18 post on X, brings decentralized sequencing, faster confirmations, and a new fee market to the Ethereum (ETH) layer-2 network.\nDecentralized sequencing and pre-confirmations\nAt the core of v0.14.0 is the move toward decentralized sequencing. Using Tendermint consensus, the network will alternate between multiple independent sequencers instead of relying solely on one. This change improves censorship resistance, ensures fair transaction ordering, and boosts fault tolerance.\nTo improve user experience with sub-second latency, the upgrade also adds a new transaction status called “pre-confirmations.” This system offers smoother performance even under high network traffic, with the majority of transactions achieving near-final confirmation in less than a second.\nBlock times will remain between 4 to 6 seconds, but pre-confirmations allow users to see results much more quickly, making this upgrade a major step in lowering wait times for routine transactions.\nFee market and technical enhancements\nStarknet (STRK) v0.14.0 employs a fee structure based on Ethereum’s EIP-1559, with a minimum base price for layer-2 gas set in FRI. This change reduces costs and increases predictability by cutting the connection between Ethereum gas prices and Starknet fees.\nAlong with adding new transaction statuses to RPC 0.9.0 and updating the mempool architecture, the release also makes multi-block processing possible to increase proving efficiency. The roadmap shows that future updates will progressively decentralize sequencer operations, even though StarkWare will still be in charge of them in this version.\nTo ensure a seamless migration, there will be a brief outage of roughly 15 minutes during the switch to v0.14.0, during which time transactions will be temporarily paused.\nRecent Starknet ecosystem developments\nThe upcoming upgrade follows a series of ecosystem milestones. Extended, a perpetual trading decentralized exchange with over 50 trading pairs and leverage of up to 100x, debuted on the Starknet mainnet on Aug. 12. . Earlier this month, the community voted on SNIP-31, a proposal introducing Bitcoin (BTC) staking through tokenized assets such as WBTC and tBTC.\nIn its July recap, Starknet announced improvements to its mempool, the launch of the fee market, faster block times, and a shift to sole support for V3 transactions using STRK as the gas token.\nAll of these advancements point to Starknet’s drive for decentralization, scalability, and wider Ethereum rollup ecosystem adoption.", "authors": "Crypto News", "published": "2025-08-19T04:59:49Z", "url": "https://crypto.news/starknet-v0-14-0-upgrade-live-on-mainnet-2025/", "source": "trafilatura"}
{"domain": "https://decrypt.co", "title": "SEC Punts on Trump Media Bitcoin and Ethereum ETF Decision, Plus XRP and Dogecoin Funds", "text": "In brief\n- The SEC will decide on the Truth Social Bitcoin and Ethereum ETF on October 8, likely after a rules change request from two exchanges that could shorten approval processes.\n- The agency delayed decisions on XRP funds from Grayscale, Bitwise, CoinShares, Canary Capital, and 21Shares.\n- It also pushed back deadlines on separate Dogecoin and Litecoin ETFs, and a proposal to add staking to an existing spot Ethereum ETF.\nThe U.S. Securities and Exchange Commission has delayed its decisions on an exchange-traded fund proposed by Donald Trump's media and technology company to track the performance of Bitcoin and Ethereum and seven other ETFs based on single digital assets.\nIn a filing Monday, the regulator said that it moved its deadline back 45 days for weighing in on the Truth Social Bitcoin and Ethereum ETF to October 8.\nIt announced identical delays for applications filed for spot XRP funds by Grayscale, CoinShares, Canary Capital, Bitwise and 21Shares, a spot Dogecoin ETF from Grayscale, and a spot Litecoin product from CoinShares, although the dates for potential approvals of those funds vary.\nIt also held up resolving a request to add staking to the the 21Shares Core Ethereum ETF, which tracks the price of the second-largest cryptocurrency by market value.\nThe delays comes four days after the agency delayed decisions on Solana ETFs from Bitwise, 21Shares, and VanEck, and a Dogecoin fund from 21Shares.\nThe SEC is weighing a wave of proposals tracking cryptocurrencies. Those submissions have resulted from the dramatic success of 11 spot Bitcoin and nine Ethereum ETFs, a more favorable political environment for cryptocurrencies ushered in by the Trump administration, and growing interest by traditional finance giants who were formerly resistant to the asset.\nThe filings also follow roughly three weeks after two major U.S. exchanges asked the SEC to approve amendments that could significantly shorten the approval process for future crypto exchange-traded funds, automatically listing certain products without requiring case-by-case filings.\nIn separate filings, Cboe BZX and NYSE Arca requested changes to their listing standards that would allow certain crypto ETFs to be listed without enduring the SEC's rigorous evaluation under Rule 19b-4, a process that requires exchanges to submit proposed rule changes. Under current guidelines, such reviews of proposed changes to funds could take 240 days.\nBloomberg Senior ETF Analyst Eric Balchunas told Decrypt that the SEC's filings Monday were \"nothing significant,\" and were likely timed to follow a probable SEC green light of Cboe and NYSE's amendments next month following the conclusion of a comments period.\n\"Even though it feels like 'Isn't this SEC supposed to approve all this stuff?', the listing standards are out for comment,\" Balchunas said. \"So just in the nick of time, these listing standards should be approved. And then we're anticipating a batch of approvals based on the listing standard starting in October.\"\n\"So this delay feels discouraging, but it's just a little more patience,\" he added. \"It'll all happen soon.\"", "authors": "Decrypt", "published": "2025-08-19T01:31:04Z", "url": "https://decrypt.co/335695/sec-punts-trump-media-bitcoin-ethereum-etf-decision-xrp-dogecoin", "source": "trafilatura"}
{"domain": "https://cointelegraph.com", "title": "SEC delays rulings on Truth Social, Solana and XRP ETFs to October", "text": "The SEC has extended deadlines for three major crypto ETFs, including Truth Social’s Bitcoin-Ethereum fund, Solana products from 21Shares and Bitwise, and the 21Shares Core XRP Trust, with rulings now due in October 2025.", "authors": "Cointelegraph", "published": "2025-08-18T21:25:54Z", "url": "https://cointelegraph.com/news/sec-pushes-back-decisions-truth-social-solana-xrp-crypto-etfs", "source": "gnews_fallback", "error": "Failed to download"}
{"domain": "https://cointelegraph.com", "title": "BTCS to pay out loyalty in ETH to deter ‘predatory short-sellers’", "text": "Ethereum treasury firm BTC Inc. is set to issue an ETH dividend and loyalty payment to ward off “predatory short-sellers” as it seeks to become more competitive in the ETH treasury race.", "authors": "Cointelegraph", "published": "2025-08-19T00:20:21Z", "url": "https://cointelegraph.com/news/btcs-inc-pay-ethereum-dividend-loyalty-payment", "source": "gnews_fallback", "error": "Failed to download"}
{"domain": "https://u.today", "title": "Ethereum (ETH) Bull Market Over? Shiba Inu (SHIB) Risks Adding Zero Rocket, XRP's Last Level Before $2", "text": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\nEthereum has most likely entered a corrective phase, which could be the beginning of the end of the bull market. Ethereum has been gradually declining after reaching a peak of about $4,800, and the price action is displaying the first discernible signs of weakness since July.\nGiven that trading volume has decreased in comparison to earlier in the rally, the decline suggests that market momentum may be waning. Ethereum corrections following sharp rallies have historically tested important moving averages, and the 26-day EMA is currently the first crucial level to keep an eye on. A clean rebound prior to testing this zone would be a more convincing sign that buyers are still in control, but a drop toward this line would indicate a continuation of short-term selling pressure.\nThe larger bullish structure would hold up if ETH could bounce back above recent highs, rather than tagging the 26 EMA, indicating that this move is merely a brief cooling off. With the next layers of support located close to the 50 EMA and psychological round levels around $4,000, additional downside may become possible if the 26 EMA breaks decisively.\nThe more general question is whether the upward momentum of the cycle will end with this correction. Since long-term moving averages are still sloping upward, and Ethereum is currently trading comfortably above key support lines, it appears that the bull market is still going strong. But as Ethereum continues to decline, traders may grow increasingly wary, particularly as the market closes out derivative positions.\nShiba Inu at risk\nShiba Inu is once again close to adding a zero to its price. Following weeks of consolidation within an ascending triangle pattern, SHIB is currently close to losing the lower range, which could lead to more severe declines.\nThe failure of SHIB to produce significant upward momentum is seen clearly on the daily chart. The token is continuing to retest the support line, rather than breaking higher, which indicates a weakening setup, even though the ascending triangle formation typically leans bullish. With today’s rejection, the likelihood of a breakdown is gradually increasing, and each bounce has been weaker than the one before.\nDue to the absence of strong support zones until much lower levels, the move may accelerate rapidly, if SHIB breaks below the triangle’s support. SHIB would most likely be forced to add another zero to its price as a result of such a decline, returning it to valuations not seen since the early summer.\nLower trading volumes and the absence of whale-driven support both increase the descending momentum and lessen the likelihood of a recovery. The risk is increased by the fact that SHIB’s performance is still trailing, leading cryptocurrencies like Ethereum and Bitcoin, which have at least maintained stronger trends.\nXRP checks in\nXRP is not feeling that well, as the asset is close to entering a critical state. The token is currently declining and in danger of breaking below its 50-day exponential moving average (EMA) after failing to maintain momentum above $3. Although this level has historically been used as a temporary buffer, the current situation indicates that it might not last for very long.\nAs XRP records a string of red candles, the market’s inability to maintain bullish sentiment is putting pressure on the 50 EMA. The next strong support is located much deeper in the $2.70-$2.75 range, and the $2.40 region, which is anchored by the 200 EMA if this level fails. A breakdown of this kind would wipe out most of XRP’s recent gains and expose the token to a possible retest nearer $2.00, a psychological level that will decide whether the larger bullish cycle holds up.\nCuriously, volume data presents a somewhat different picture, even though price action appears fragile. Indicating that bears are not fully committing to the sell-off, trading volumes have been continuously dropping during the downward move. This lack of conviction allows for a potential rebound, but XRP runs the risk of crashing lower toward significant support levels in the absence of an abrupt spike in demand.\nXRP needs to regain the $3.00 mark with significant buying pressure if bulls wish to regain control. If this is not done, there may be a chance for a more severe correction, with $2.00 acting as the final key level before sentiment turns sharply against the asset.", "authors": "U.Today", "published": "2025-08-19T00:01:00Z", "url": "https://u.today/ethereum-eth-bull-market-over-shiba-inu-shib-risks-adding-zero-rocket-xrps-last-level-before-2", "source": "trafilatura"}
{"domain": "https://crypto.news", "title": "ETHZilla’s NASDAQ relaunch puts $419m Ethereum treasury in the spotlight", "text": "ETHZilla’s NASDAQ relaunch puts $419m Ethereum treasury in the spotlight\nThe rebranded firm, now holding 94,675 ETH, is betting big on Ethereum’s long-term value, with backing from Polychain, Founders Fund, and key DeFi founders.\n- ETHZilla debuts on NASDAQ with a $419m Ethereum treasury, rebranding from biotech firm 180 Life Sciences.\n- Backed by Polychain, Founders Fund, and DeFi leaders, ETHZilla aims to be a major corporate ETH holder.\nAccording to a press release dated August 18, ETHZilla Corporation has officially completed its rebranding and transition from biotech firm 180 Life Sciences to a dedicated Ethereum (ETH) treasury vehicle.\nThe company’s shares began trading under the new ticker “ETHZ” on the same day, marking a strategic shift toward accumulating and managing one of the largest corporate ETH holdings in public markets.\n“Today, we are embracing our identity as ETHZilla and our commitment to developing a market-leading strategy that seeks to bring the value of Ethereum to investors in the public markets,” McAndrew Rudisill, Executive Chairman of the Board of Directors of the Company, said.\nWith 94,675 ETH acquired at an average price of $3,902 and now worth approximately $419 million, the move signals a growing institutional embrace of Ethereum as a treasury asset.\nETHZilla’s institutional backing and pivot into Ethereum\nAccording to ETHZilla’s announcement, its treasury strategy is designed to leverage Ethereum’s dual role as both a store of value and a yield-generating asset. The company said it has partnered with Electric Capital to maximize returns through staking, DeFi lending, and liquidity provisioning, positioning the firm to benefit from Ethereum’s expanding utility beyond mere price appreciation.\nThe pivot from biotech to Ethereum treasury management came after ETHZilla raised $565 million in private funding, with backing from over 60 institutional and crypto-native investors.\nThe list features both a deep bench of both institutional capital and Ethereum-native builders. Polychain Capital, Electric Capital, and Peter Thiel’s Founders Fund anchor the institutional side, while key DeFi founders, including EigenLayer’s Sreeram Kannan, Lido’s Konstantin Lomashuk, and Compound’s Robert Leshner, lend credibility to the venture. Their participation suggests confidence not just in ETHZilla’s model, but in Ethereum’s long-term viability as a cornerstone of decentralized finance.\nWhile ETHZilla’s treasury strategy dominates headlines, the company hasn’t abandoned its roots entirely. The company said its legacy biotech assets remain part of the portfolio, with plans to monetize intellectual property, and its gaming division continues to operate. This diversified approach could provide stability if crypto markets turn volatile, though the firm’s future now hinges on Ethereum’s performance.", "authors": "Crypto News", "published": "2025-08-18T20:25:51Z", "url": "https://crypto.news/ethzillas-nasdaq-relaunch-puts-419m-ethereum-treasury-in-the-spotlight/", "source": "trafilatura"}
{"domain": "https://www.benzinga.com", "title": "Bitcoin, Ethereum, XRP, Dogecoin Continue Slide Lower", "text": "- Global cryptocurrency market capitalization dips 1.9% to $3.9 trillion.\n- Trader notes Bitcoin’s key short-term level to reclaim is around $117.5K, while another highlights the $114K–$116K zone as key area.\n- Get more market-moving news first with AI-powered analysis that turns noise into opportunity.\nCryptocurrency markets are trading lower on Monday, with analysts fearing a further slide in prices.\n| Cryptocurrency | Ticker | Price |\n| Bitcoin | BTC/USD | $116,355.23 |\n| Ethereum | ETH/USD | $4,369.60 |\n| Solana | SOL/USD | $183.81 |\n| XRP | XRP/USD | $3.07 |\n| Dogecoin | DOGE/USD | $0.2239 |\n| Shiba Inu | SHIB/USD | $0.00001275 |\nNotable Statistics:\n- Coinglass data shows 124,371 traders were liquidated in the past 24 hours for $530.47 million.\n- SoSoValue data shows net outflows of $14.1 million from spot Bitcoin ETFs on Wednesday. Spot Ethereum ETFs saw net outflows of $59.3 million.\n- The top losers in the past 24 hours include Pump.fun PUMP/USD, Sky SKY/USD and Virtuals Protocol VIRTUAL/USD.\nNotable Developments:\n- BitMine’s Crypto Holdings Surpass 1.52 Million ETH To Become Second-Biggest Crypto Treasury\n- Tom Lee’s $5 Billion Ethereum Bet Puts Bitcoin Maximalists On Notice\n- Strategy’s Bitcoin Stash Hits 629,376 BTC—More Than Tesla, Coinbase, Marathon Digital Combined\n- Bitcoin, Ethereum ETFs Diverge As ETH Takes The Lead BlackRock’s IBIT Shines\n- Circle-Backed Company’s Yen Stablecoin Nears Official Approval In Japan: Report\n- Shiba Inu Coin Teams Up For K-Pop Festival With Squid Game Challenges And Top Korean Rap Stars\nTrader Notes: Bob Loukas highlighted that Bitcoin failed to break its all-time highs late in the weekly cycle, likely peaking around Week 18.\nHowever, a swift recovery could still alter that outcome.\nDespite the short-term setback, the broader four-year cycle remains bullish, with upside surprises still possible.\nMeanwhile, altcoins are showing strength as Bitcoin dominance declines, signaling typical late-stage cycle behavior.\nMore Crypto Online noted that Bitcoin's focus remains on whether wave 2 has completed.\nWhile it's too early to confirm, a decisive break above the yellow trendline would serve as the first indication that wave 2 may have bottomed.\nDaan Crypto Trades observed that Bitcoin recently retested the 0.786 Fibonacci retracement level, historically a strong reaction point in this cycle.\nThe larger trading range has held steady over the past six weeks.\nIn the short-term, reclaiming $117,500 would be crucial to moving back above the 4-hour 200MA and EMA.\nCrediBULL Crypto added that Bitcoin has tested the expected range lows as anticipated.\nIf this marks the local bottom, sideways price action within the range could follow before a stronger upward move.\nThe $114,000–$116,000 zone remains the key area of interest, while a push above $120,000 would help confirm this as a local bottom. The strength and nature of the next move, impulsive or corrective, will indicate which scenario is playing out.\nRead Next:\nImage: Shutterstock\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "authors": "Benzinga", "published": "2025-08-18T19:51:25Z", "url": "https://www.benzinga.com/crypto/cryptocurrency/25/08/47195513/bitcoin-ethereum-xrp-dogecoin-continue-slide-lower", "source": "trafilatura"}
{"domain": "https://www.benzinga.com", "title": "Bitcoin, Ethereum, Dogecoin, XRP Slide As Crypto Liquidations Top $500 Million: Analyst Says This Is What Is In Store For BTC In The Current Quarter", "text": "Leading cryptocurrencies fell further, while stocks barely changed on Monday as investors trimmed risk appetite.\n| Cryptocurrency | Gains +/- | Price (Recorded at 9:20 p.m. ET) |\n|---|---|---|\n| Bitcoin BTC/USD | -0.81% | $116,487.79 |\n| Ethereum ETH/USD | -2.77% | $4,339.70 |\n| XRP XRP/USD | -0.15% | $3.07 |\n| Solana SOL/USD | -2.50% | $185.09 |\n| Dogecoin DOGE/USD | -3.37% | $0.2244 |\nMore Than $400 Million In Longs Liquidated\nBitcoin sank below $115,000 early morning but recovered to above $117,000 by evening. Trading volume jumped nearly 50% over the last 24 hours.\nEthereum also rebounded to $4,400, but the rally could not be sustained, pushing the coin back to the early $4,300s overnight. XRP and Solana fell 0.15% and 2.50%, respectively.\nETH's dominance rose to 13.3%, while Bitcoin's market share dropped below 59%.\nOver $535 million was liquidated from the market over the last 24 hours, with long positions accounting for $436 million. Around $422 million in BTC longs risk liquidation if the coin slips below $114,000.\nBitcoin's open interest fell 1.24% over the last 24 hours. Meanwhile, over 57% of Binance traders with open BTC positions were betting in favor of the coin's rally.\nThe \"Greed\" sentiment dropped further to 56, according to the Crypto Fear & Greed Index, signaling an increase in selling pressure.\nTop Gainers (24 Hours)\n| Cryptocurrency | Gains +/- | Price (Recorded at 9:20 p.m. ET) |\n|---|---|---|\n| AB (AB) | +7.52% | $0.009614 |\n| OKB (OKB) | +5.27% | $123.01 |\n| POL (POL) | +3.18% | $0.2559 |\nThe global cryptocurrency market capitalization stood at $4.02 trillion, following a decline of 3.87% in the last 24 hours.\nAll Eyes On Jerome Powell\nStocks were little changed on Monday. The Dow Jones Industrial Average fell 34.30 points, or 0.08%, to close at 44,911.82. The S&P 500 dipped 0.01% to close at 6,449.15. The Nasdaq Composite was the outlier, closing up 0.03% at 21,629.77.\nInvestors are looking forward to Federal Reserve Chair Jerome Powell’s speech at the Jackson Hole Economic Policy Symposium on Friday for signals on monetary policy.\nTraders are pricing in an 83% chance that the central bank cuts interest rates at its September meeting, according to the CME FedWatch tool.\nWill Whale Accumulation Power Bitcoin Up?\nOn-chain analytics firm Santiment stated that Bitcoin whales have been accumulating since the dip from last week's all-time high.\n\"With prices -6.22% since August 13th, wallets with 10-10,000 BTC have accumulated 20,061 more coins,\" Santiment added.\nThe firm indicated a \"notable correlation\" between the cohort's holdings and BTC's future price movement.\nWidely followed cryptocurrency analyst BitBull highlighted the \"worst case scenario\" for the apex cryptocurrency\n\"It’ll continue to consolidate between $112,000-$120,000 in Q3, while alts will head higher. We could even see a capitulation wick below $112,000, just like we had a pump above $124,000,\" the analyst projected.\nPhoto Courtesy: Volodymyr Maksymchuk on Shutterstock.com\nRead Next:\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "authors": "Benzinga", "published": "2025-08-19T02:06:30Z", "url": "https://www.benzinga.com/crypto/cryptocurrency/25/08/47200095/bitcoin-ethereum-dogecoin-xrp-slide-as-crypto-liquidations-top-500-million-analyst-says-this-is-what-is-in-store-for-btc-in-the-current-quarter", "source": "trafilatura"}
{"domain": "https://coingape.com", "title": "Will Profit-Taking Push ETH to $4K?", "text": "Highlights\n- Ethereum risks retesting $4,000 before any chance of recovery.\n- Whales book massive ETH profits, fueling increased selling pressure.\n- Seller dominance confirmed as Spot Taker CVD tilts heavily negative.\nEthereum price has retraced sharply after failing to hold above $4,700, raising new market concerns. The price has slipped to $4,335, marking a 4.35% daily decline, highlighting rising bearish outlook. The selling pressure has been rising as profit-taking accelerates among whales, adding weight to the correction. Technicals indicate that $4,000 is a key level that may be retested before any potential recovery.\nFrequently Asked Questions (FAQs)\n1. Why is Ethereum price falling today?\n2. What key level should traders watch next?\n3. How do whales influence Ethereum price movements?\n- October Could Be a Make-or-Break Month for Ripple- Lawyer Amid XRP ETF and Banking License Decision\n- Chamath Palihapitiya Files $250M SPAC Aiming at America’s Strategic Tech Sectors\n- U.S. Treasury Seeks Public Input on GENIUS Act Stablecoin Rules\n- Breaking: SEC Postpones Decision On XRP ETFs, Along With DOGE and LTC Funds\n- Breaking: SEC Delays Decision on Trump’s Truth Social Bitcoin and Ethereum ETF\n- Pi Coin Price Prediction: Analyst Eyes $0.50 as Mainnet Migration Intensifies\n- Cardano Price Forecast: Analyst Eyes $1.10 Despite Crypto Crash as Futures Volume Soars and ETF Odds Hit 82%\n- Popular Analyst Sees XRP Price Surge After Forming “Too Perfect” Pattern\n- Shiba Inu Price Targets $0.000026 Amid 4.7M Token Burn and Shibarium Security Boost\n- Dogecoin Price Prediction- Analyst Projects $1.4 as Grayscale Updates ETF Filing", "authors": "CoinGape", "published": "2025-08-18T21:23:38Z", "url": "https://coingape.com/markets/ethereum-price-prediction-profit-taking-4k/", "source": "trafilatura"}
