{"subreddit": "bnb", "title": "Pourquoi BNB est-il si populaire parmi les crypto-investisseurs ?", "author": "MondialSwap", "score": 1, "url": "https://reddit.com/r/BnB/comments/1letxr6/pourquoi_bnb_estil_si_populaire_parmi_les/", "created_utc": 1750284052.0, "id": "1letxr6", "selftext": "Salut à tous les passionnés de crypto ! Aujourd'hui, parlons de BNB, le jeton natif de la plateforme Binance. Lancé en 2017, BNB a rapidement grimpé les échelons pour devenir l'une des cryptomonnaies les plus populaires. Mais qu'est-ce qui fait vraiment la force de BNB ? Est-ce seulement son association avec la plus grande bourse de crypto au monde, ou y a-t-il plus derrière ce succès ?\n\nCertains louent BNB pour ses utilisations variées, allant des réductions de frais de transaction à l'accès à des offres exclusives sur Binance. D'autres, cependant, se montrent plus critiques, soulignant les risques liés à la centralisation et à la dépendance à une seule plateforme. Alors, qu'en pensez-vous ? BNB est-il une pièce maîtresse dans votre portefeuille crypto, ou préférez-vous diversifier ailleurs ? Partagez vos expériences et vos points de vue !\n\nCedric de MondialSwap", "num_comments": 0}
{"subreddit": "bnb", "title": "HK!", "author": "[deleted]", "score": 1, "url": "https://reddit.com/r/BnB/comments/1jss8cq/hk/", "created_utc": 1743939802.0, "id": "1jss8cq", "selftext": "#BNBSuperMeetupHK\n@BNBChainZH", "num_comments": 0}
{"subreddit": "bnb", "title": "أنشِئ حسابًا على أكبر منصّة لتداول العملات الرقمية في العالم.", "author": "Clear_Leg2883", "score": 1, "url": "https://reddit.com/r/BnB/comments/1guod9e/أنشئ_حسابا_على_أكبر_منصة_لتداول_العملات_الرقمية/", "created_utc": 1731988569.0, "id": "1guod9e", "selftext": "", "num_comments": 0}
{"subreddit": "bnb", "title": " Bnb", "author": "Sad-Combination7173", "score": 1, "url": "https://reddit.com/r/BnB/comments/1btmhz4/bnb/", "created_utc": 1712022301.0, "id": "1btmhz4", "selftext": "", "num_comments": 0}
{"subreddit": "bnb", "title": "I have wbtc bep20 anyone know how to and where to swap", "author": "bilalqurashi885", "score": 1, "url": "https://reddit.com/r/BnB/comments/1an9med/i_have_wbtc_bep20_anyone_know_how_to_and_where_to/", "created_utc": 1707545347.0, "id": "1an9med", "selftext": "", "num_comments": 0}
{"subreddit": "bnb", "title": "Binance Leads Crypto Exchange Volume in January Despite Regulatory Hurdles", "author": "azcoinnews", "score": 1, "url": "https://reddit.com/r/BnB/comments/1aieoca/binance_leads_crypto_exchange_volume_in_january/", "created_utc": 1707018646.0, "id": "1aieoca", "selftext": "", "num_comments": 0}
{"subreddit": "bnb", "title": "I Never Missed Out On Any Binance Launchpool 🚀 This Is The Trick You Need To Know", "author": "bordoisse", "score": 1, "url": "https://reddit.com/r/BnB/comments/1afqt88/i_never_missed_out_on_any_binance_launchpool_this/", "created_utc": 1706730630.0, "id": "1afqt88", "selftext": "", "num_comments": 0}
{"subreddit": "bnb", "title": "Binance Launchpool may add these projects in the future, analysts say", "author": "azcoinnews", "score": 1, "url": "https://reddit.com/r/BnB/comments/1ac1b1a/binance_launchpool_may_add_these_projects_in_the/", "created_utc": 1706326308.0, "id": "1ac1b1a", "selftext": "", "num_comments": 0}
{"subreddit": "xrp", "title": "Xaman wallet locked", "author": "CropDropTopMop", "score": 3, "url": "https://reddit.com/r/XRP/comments/1mu9r40/xaman_wallet_locked/", "created_utc": 1755581438.0, "id": "1mu9r40", "selftext": "I need some serious help, I cannot find the keys to my xaman anywhere so I created a new wallet and was going to transfer my xrp to that wallet. Well it seems like I put a security password on my account in order to send any xrp. And for some mf reason I cannot for my life of me figure out that password. Is there anyway to bypass that password? I have some serious money in this wallet and literally want to throw up at the thought of looking at it and not being able to do anything with it.", "num_comments": 3}
{"subreddit": "xrp", "title": "Cold wallets", "author": "Life-Dimension2617", "score": 6, "url": "https://reddit.com/r/XRP/comments/1mu9kf8/cold_wallets/", "created_utc": 1755580818.0, "id": "1mu9kf8", "selftext": "Hey guys so I have been storing my xrp on my Ledger Flex. I have heard many say not to use it for xrp, while at the same time it’s considered a top tier wallet. I have listened to people like Jake Claver talk about D’cent for its biometrics. I just hate to need to get another cold wallet unless it’s truly the better option for a separate wallet. What would be an alternative recommendation to be better for a cold wallet. Like I mentioned D’cent, then Tangem, Arculus. What is the best cold wallet for xrp?", "num_comments": 5}
{"subreddit": "xrp", "title": "10000k$", "author": "juggubuggule", "score": 0, "url": "https://reddit.com/r/XRP/comments/1mu9jk3/10000k/", "created_utc": 1755580734.0, "id": "1mu9jk3", "selftext": "Hi new here, i have 3700 coins... how many of you think we will hit 10000k by the end of the year", "num_comments": 2}
{"subreddit": "xrp", "title": "Next buy in", "author": "Smart-Growth-5611", "score": 31, "url": "https://reddit.com/r/XRP/comments/1mu2tli/next_buy_in/", "created_utc": 1755561463.0, "id": "1mu2tli", "selftext": "Just curious where everyone thinks the next buy-in price is? 3.00? 3.10? 2.90 if it ever dips again?", "num_comments": 21}
{"subreddit": "xrp", "title": "Ripple Applies for U.S. National Trust Bank Charter - Status is currently “Receipt” (pending) - meaning the OCC has it under review", "author": "bgballin", "score": 120, "url": "https://reddit.com/r/XRP/comments/1mu10w7/ripple_applies_for_us_national_trust_bank_charter/", "created_utc": 1755556896.0, "id": "1mu10w7", "selftext": "", "num_comments": 3}
{"subreddit": "xrp", "title": "Was I too late?", "author": "MDUexpanding", "score": 24, "url": "https://reddit.com/r/XRP/comments/1mtwpgs/was_i_too_late/", "created_utc": 1755547107.0, "id": "1mtwpgs", "selftext": "I have 200 XRP with an avg price of 3.02, was I too late on buying? I’m new to crypto, I don’t know what else I should be investing in.", "num_comments": 67}
{"subreddit": "xrp", "title": "Should I swap all of my shib for Xrp?", "author": "Prstar1", "score": 60, "url": "https://reddit.com/r/XRP/comments/1mtua0m/should_i_swap_all_of_my_shib_for_xrp/", "created_utc": 1755541767.0, "id": "1mtua0m", "selftext": "Hello everyone, I'm relatively new to crypto so I'm hoping someone here can give me some advice. I'm thinking about swapping all of my shib for xrp. Should I?", "num_comments": 55}
{"subreddit": "xrp", "title": "Best storage for xrp uk ?", "author": "danw37", "score": 7, "url": "https://reddit.com/r/XRP/comments/1mtu3kp/best_storage_for_xrp_uk/", "created_utc": 1755541376.0, "id": "1mtu3kp", "selftext": "Hi guys was just wondering where is best place to store xrp I’ve seen a lot of stories about exchange blocking withdrawals etc so wanted to get it off the exchange. Tia\n\n\n\n\n\n\n\n\n\n\n\n\n…\n\n\n\nZzz", "num_comments": 4}
{"subreddit": "xrp", "title": "XRP Swapping Question", "author": "bluepacky", "score": 13, "url": "https://reddit.com/r/XRP/comments/1mts418/xrp_swapping_question/", "created_utc": 1755537114.0, "id": "1mts418", "selftext": "I see a lot of people suggesting the big CEX's for swapping XRP for the least amount of fees, but there comes long term capital gains tax which quite honestly deters any reason for swapping, IMO. Not finding any good references for how you can move XRP around other than flat out selling &amp; buying again or swapping on a CEX and eating the capital gains tax. Not many DEX seem to support native XRP, and there's so many exchanges with horror stories it's hard to know what you can or can't trust. That being said, I'm curious as to what is the most efficient, safe way to move XRP from a cold wallet (e.g. trezor) to a DEX that supports xrp swapping and preferably no KYC.\n\nYou can swap within exodus/trezor but I've heard those fees are high - appears to be anywhere between 3-7% or higher. I've also seen XRP has a built-in DEX, but quite frankly it doesn't have a very intuitive UI for non-coders.\n\nCan someone explain the steps in which you would follow to swap XRP to say SOL, as an example? What should you expect to lose in fees for a transaction like this, 1%?\n\ne.g.:\n\n1. In Trezor, send XRP to Uniswap address\n\n2. In Uniswap, initiate the swap from XRP to SOL\n\n3. Send SOL back to SOL trezor address", "num_comments": 2}
{"subreddit": "xrp", "title": "08/18/25 [Join XRPhoenix Discord] - discord.com/invite/XRPhoenix", "author": "AutoModerator", "score": 0, "url": "https://reddit.com/r/XRP/comments/1mtoi0d/081825_join_xrphoenix_discord/", "created_utc": 1755529292.0, "id": "1mtoi0d", "selftext": "# XRPhoenix Discord\n\n\\&gt;&gt;&gt; Invite Link: [discord.com/invite/XRPhoenix](https://discord.com/invite/XRPhoenix)\n\nOfficial Discord for the following subs:\n\n* r/XRP\n* r/Ripple\n\nChannels\n\n1. Announcements\n2. News and media\n3. ​Infographics and visual aids\n\nCategories\n\n1. Exchanges &amp; Wallets, FinTech, DeFi &amp; NFTs, Investing, Cryptocurrency\n2. Interledger Protocol, RippleX, Polysign\n3. XRPL Labs, Xaman (previously Xumm)\n\nSpecial Perks for the XRPhoenix Discord server boosters\n\n\\*We will never send you a DM or a friend request. Beware of scammers.", "num_comments": 0}
{"subreddit": "xrp", "title": "Xrp talk", "author": "Front-Cricket3076", "score": 173, "url": "https://reddit.com/r/XRP/comments/1mtexvg/xrp_talk/", "created_utc": 1755500679.0, "id": "1mtexvg", "selftext": "I’m a buyer of xrp, and I believe there is lots of potential, but my beliefs are like $20-30 a coin can you guys explain to me why you guys believe it will be $1000-$10,000 a coin?", "num_comments": 159}
{"subreddit": "xrp", "title": "News", "author": "Current_Attention_92", "score": 113, "url": "https://reddit.com/r/XRP/comments/1mt89ud/news/", "created_utc": 1755479543.0, "id": "1mt89ud", "selftext": "There's a lot of talk about stablecoins in crypto, but most miss the bigger picture. To understand the shift, we need to examine stablecoins, their purpose, XRP, and the broader financial system as they evolve toward a digital economy.\n\nStablecoins are the next evolution of fiat\n\nStablecoins are digital versions of traditional currencies. Some come from central banks, others from regulated institutions. They function like Central Bank Digital Currencies without the label. They're meant to bring stability and faster transactions while backed by fiat. But if tied to fiat, the fundamental problem remains. The real game changer is infrastructure. Many of these new stablecoins will run on RippleNet using XRP and On-Demand Liquidity to move value instantly Over time, crypto will converge with this technology and the broader financial system. XRP is the universal settlement layer, powering tokenized assets, liquidity, and cross-sector payments efficiently.\n\nWhy XRP matters\n\nWell, as stablecoin demand grows, XRP's role as liquidity backbone becomes essential. XRP is not a speculative asset, it's a commodity for the digital economy. The adoption by institutions reduces friction and costs in cross-border payments confirms it. This is a long-term structural shift in how digital money moves. Few will see it until it's too late.\n\nThe double-edged nature of stablecoins\n\nCentral banks have used cycles of liquidity and debt restructuring since 2008. Stablecoins provide a new liquidity source, extending these cycles and managing systemic risk. RLUSD, the proposed digital dollar, shows how institutions expand the dollar digitally. Integrating stablecoins with existing infrastructure prepares for a digital asset-dominant world.\n\nControl and decentralization\n\nStablecoins integrate people into the debt-based system digitally. XRP could operate fully decentralized, but current approaches bridge to legacy systems, giving institutions control while providing liquidity.\n\nSystemic risks\n\nCrypto volatility is inevitable. Over-leveraged participants face risk. Markets remain tied to economic pressures, credit constraints, Al-driven trading, and systemic factors. Understanding this allows anticipation rather than reaction.\n\nLong-term perspective\n\nDigital assets integrated with the broader system, especially XRP, will play a critical role. Stablecoin growth and XRP-backed infrastructure favor utility and adoption over speculation. Those who understand XRP in banking and settlement will navigate these changes best.\n\nFinal thoughts\n\nStablecoins evolve fiat and integrate traditional finance with digital infrastructure. XRP sits at the center as a liquidity source, enabling global settlements. Focus on facts, not narratives, to survive and thrive in this pivotal moment.", "num_comments": 39}
{"subreddit": "xrp", "title": "Price manipulation, scary?", "author": "OrangeAppleFlap", "score": 109, "url": "https://reddit.com/r/XRP/comments/1mt0nf7/price_manipulation_scary/", "created_utc": 1755460091.0, "id": "1mt0nf7", "selftext": "Found this on several sites. Sounds a bit shabby. What should we expect or fear from this? And what if it is really washing or something like that on the XRPL? If I may be thinking out loud that would mean that Ripple is keeping the demand and activity high artificially? So they pretend to be the chosen one?\n\nAnd in what way could this be positive?\n\nJust looking for serious advice..", "num_comments": 66}
{"subreddit": "xrp", "title": "08/17/25 [Join XRPhoenix Discord] - discord.com/invite/XRPhoenix", "author": "AutoModerator", "score": 4, "url": "https://reddit.com/r/XRP/comments/1mst6v9/081725_join_xrphoenix_discord/", "created_utc": 1755442893.0, "id": "1mst6v9", "selftext": "# XRPhoenix Discord\n\n\\&gt;&gt;&gt; Invite Link: [discord.com/invite/XRPhoenix](https://discord.com/invite/XRPhoenix)\n\nOfficial Discord for the following subs:\n\n* r/XRP\n* r/Ripple\n\nChannels\n\n1. Announcements\n2. News and media\n3. ​Infographics and visual aids\n\nCategories\n\n1. Exchanges &amp; Wallets, FinTech, DeFi &amp; NFTs, Investing, Cryptocurrency\n2. Interledger Protocol, RippleX, Polysign\n3. XRPL Labs, Xaman (previously Xumm)\n\nSpecial Perks for the XRPhoenix Discord server boosters\n\n\\*We will never send you a DM or a friend request. Beware of scammers.", "num_comments": 1}
{"subreddit": "xrp", "title": "XRP vs. MC and VISA", "author": "bearlyhuman4697", "score": 96, "url": "https://reddit.com/r/XRP/comments/1mssvwx/xrp_vs_mc_and_visa/", "created_utc": 1755442159.0, "id": "1mssvwx", "selftext": "For many, many years I've heard of the big credit card companies taking greedy chunks from small biz owners as a required % of payments. We as consumers paid the price.\n\nSo these days I find myself rooting for XRP and others to disrupt the payments industry, similar to how Tesla disrupted the outdated middleman/ greedy dealership model of the automotive world, and they indeed leaped over the biggest players seemingly overnight.\n\nAny ideas on how Ripple and others could take over?  MC and VISA had their time in the sun, but imho should finally be humbled.\n\n", "num_comments": 35}
{"subreddit": "xrp", "title": "Found an old wallet file, is it possible to recover my funds?", "author": "bobotopo", "score": 16, "url": "https://reddit.com/r/XRP/comments/1msqvdy/found_an_old_wallet_file_is_it_possible_to/", "created_utc": 1755437132.0, "id": "1msqvdy", "selftext": "Found an old ripple wallet file with 808 characters, it ends with 0=.   \nI have no idea how to recover it, is it possible?  \n", "num_comments": 4}
{"subreddit": "xrp", "title": "Wellgistics Health has launched XRP payment program", "author": "RealFlummi", "score": 191, "url": "https://reddit.com/r/XRP/comments/1msolhf/wellgistics_health_has_launched_xrp_payment/", "created_utc": 1755430590.0, "id": "1msolhf", "selftext": "", "num_comments": 16}
{"subreddit": "xrp", "title": "When do you think XRP price is going up?", "author": "OrangeAppleFlap", "score": 0, "url": "https://reddit.com/r/XRP/comments/1ms23mm/when_do_you_think_xrp_price_is_going_up/", "created_utc": 1755365969.0, "id": "1ms23mm", "selftext": "Serious question, when do you guys and girls thing XRP is going up? What are events, dates, and possibilities that we will go higher? \n\nLooking forward to your reactions!\n\n", "num_comments": 59}
{"subreddit": "xrp", "title": "Cold wallet", "author": "North-Flatworm7428", "score": 46, "url": "https://reddit.com/r/XRP/comments/1mry813/cold_wallet/", "created_utc": 1755357587.0, "id": "1mry813", "selftext": "I have a question. \nLoaded a bag of 500 XRP and put it on a Ledger x. \n\nI have seen some \"influencers\" saying that people shouldn't put their XRP in a cold Wallet because it  won't be able to go back on the exchange. \n\nSo now I'm confused. \nIs there something to it or are those people that recommend this braindead? \n\nThey also talked a lot about Web 3.0 and I have no idea what this means.", "num_comments": 58}
{"subreddit": "xrp", "title": "Charts", "author": "dawgw", "score": 16, "url": "https://reddit.com/r/XRP/comments/1mrofol/charts/", "created_utc": 1755330294.0, "id": "1mrofol", "selftext": "Has anyone noticed the charts on different time intervals moving slower this last week? Like the coinbase advanced, crypto market, and trading view  all have weird movement right now.", "num_comments": 3}
