{"domain": "https://www.benzinga.com", "title": "Bitcoin, Ethereum, Solana Struggle But This Crypto Keeps Outperforming In The Dip", "text": "- Solana and Chainlink show resilience against Bitcoin, positioning as potential leaders if crypto market sentiment improves.\n- Analysts see speculative potential in smaller tokens like Hyper but stress broader market stability for lasting gains.\n- Get more market-moving news first with AI-powered analysis that turns noise into opportunity.\nBitcoin's BTC/USD recent breakdown below support has injected caution across the cryptocurrency market, but certain altcoins are displaying resilience.\nAccording to market commentary from pseudonymous analyst EmperorBTC on Monday, Bitcoin failed to hold a key support level and warned that if a bearish retest plays out with low trading volume, price could slide further.\nThe next logical level for potential support, he suggested, would be near $110,000, down from the current $113,000 area.\nEthereum ETH/USD, meanwhile, has also come under pressure.\nAfter initially showing strength with a short-term long setup, ETH has dropped back into the consolidation range seen in early August.\nA bearish retest of the range highs has left the asset vulnerable, with the analyst cautioning traders against \"blind longing alts\" while Bitcoin remains weak.\nIn contrast, Solana SOL/USD has shown signs of relative strength.\nEmperorBTC highlighted that SOL has successfully defended both its quarterly and August opens across multiple tests, with a key support zone identified near $178–$180.\nAlso Read: Bitcoin, Ethereum ETFs Diverge As ETH Takes The Lead BlackRock’s IBIT Shines\nIf the broader market stabilizes, he suggested Solana could mount a recovery toward the $230 level before year-end, drawing comparisons to Ethereum's past rallies.\nChainlink LINK/USD has also stood out among major tokens.\nThe asset gained 13% in a single day and held most of those gains, making it one of the strongest performers during the recent downturn.\nThe analyst noted that if Bitcoin steadies above $115,000, LINK could aim for the $29 level, though a deeper pullback remains possible if broader weakness continues.\nSmaller tokens are also drawing speculative interest.\nEmperorBTC pointed to Hype HYPE/USD as a \"gamble\" at long-term support, with low selling volume suggesting it could bounce if the overall market finds stability.\nThe analysis hints that Bitcoin's inability to reclaim support may dictate the next leg lower, but altcoins like Solana and Chainlink are emerging as potential leaders if conditions improve.\nRead Next:\nImage: Shutterstock\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "authors": "Benzinga", "published": "2025-08-18T13:39:01Z", "url": "https://www.benzinga.com/crypto/cryptocurrency/25/08/47184739/bitcoin-ethereum-solana-struggle-but-this-crypto-keeps-outperforming-in-the-dip", "source": "trafilatura"}
{"domain": "https://www.indiatimes.com", "title": "Crypto price predictions; Ethereum, XRP, Solana and why Remittix could be set to outperform them all this bull run", "text": "Crypto price predictions; Ethereum, XRP, Solana and why Remittix could be set to outperform them all this bull run\nEthereum, XRP, and Solana are posting strong gains, but all eyes are turning to Remittix, a fast-growing presale project tackling the $19 trillion payments industry. With $19.4M+ raised and real-world remittance utility, RTX could be a standout in the 2025 bull run.\nThe cryptocurrency market is abuzz with top assets putting up strong performances. Ethereum is going for $4,690.65, a 9.26% gain in 24 hours. XRP is at $3.27 following a 3.22% increase, while Solana has risen 14.15% to $202.15.\nHowever, behind such headlines, there is a new project Remittix that is making waves with its cutting-edge payment solutions and budding presale strength.\nMarket Leaders Putting Up Strong Performances, but Focus Shifts to Newcomers\nWhile Ethereum price prediction, XRP price prediction and Solana analysis dominate discussion forums, investors now pay closer attention to projects that solve real-world problems.\nEthereum's $566.66 Billion market capitalization and $67.81 Billion daily trading volume highlight its status as the most significant smart contract platform. XRP's $194.39 billion market capitalization solidifies its position in cross-border payment. Solana's $108.88 Billion valuation and over 120% growth in trading volume reflect high network activity.\nThese numbers illustrate that older assets still hold significant sway. However, in a market where utility often determines long-term valuation, the attention is shifting to newer altcoins that combine strong fundamentals with genuine use cases in the real world. That's where Remittix (RTX) enters the fray.\nRemittix: Solving a $19 Trillion Payments Problem\nRemittix is developing a crypto-to-fiat bridge that enables users to send cryptocurrencies directly to bank accounts in over 30 countries in minutes. The process aims to enable quicker, cheaper and more transparent international remittances. Valued at $0.0944 per token, the project has already exceeded $19.4 million in its presale, selling over 599 million tokens.\nTheir Q3 beta wallet release will be a mobile-first platform that will accommodate 40+ cryptos and 30+ fiats with real-time FX conversion. For small businesses, freelancers and global workers, this could be a game changer.\n- $19.4 million + raised, one of 2025's fastest-growing presales\n- 40% token bonus for a limited time\n- Beta wallet release in Q3 2025\n- Crypto-to-bank transfers in 30+ countries directly\n- $20 million Milestone to Trigger First CEX Reveal\nMomentum is building towards the $20 million presale milestone, which will unlock the announcement of Remittix's first centralized exchange listing. The milestone can potentially bring:\nOn top of this, Remittix has launched a $250,000 giveaway, adding an extra incentive for early movers.\nWhy Remittix Stands Out in 2025\nIn a year when investors are searching for the best crypto project 2025, low gas fee crypto projects and the next big altcoin 2025, Remittix offers a blend of real-world utility and growth potential. Its value proposition is clear, unlike that of speculative meme coins: real-world payments, global coverage and audited secure infrastructure by CertiK.\nAs Ethereum, XRP and Solana continue to post stellar figures, Remittix's possibilities to penetrate a vast payments market and achieve product milestones could see it take a significant share of the next bull run. For investors searching for the best crypto under $1 with actual use cases, RTX is rapidly becoming one of the most robust names to watch.\nDiscover the future of PayFi with Remittix by checking out their project here:\nWebsite: https://remittix.io/\nSocials: https://linktr.ee/remittix\n$250,000 Giveaway: https://gleam.io/competitions/nz84L-250000-remittix-giveaway", "authors": "Indiatimes", "published": "2025-08-18T09:22:46Z", "url": "https://www.indiatimes.com/partner/crypto-price-predictions-ethereum-xrp-solana-and-why-remittix-could-be-set-to-outperform-them-all-this-bull-run-667062.html", "source": "trafilatura"}
{"domain": "https://crypto.news", "title": "Solana RWAs grow reach $390M, up 124% YTD: Messari report", "text": "Solana RWAs grow reach $390M, up 124% YTD: Messari report\nA quarterly report by Messari shows a significant rise in RWAs on Solana, as BlackRock, Apollo expand funds.\n- RWAs on Solana rise 124% YTD, to $390 million\n- Solana’s DeFi TVL rose to $8.6 billion, rising 30% QoQ\n- Staking and liquid staking are on the rise, with 12% liquid staking penetration\nSolana’s (SOL) ecosystem continues to expand, while some metrics remain mixed. On Monday, August 18, Messari Protocol Services released a quarterly report on the state of the Solana network. The report shows a significant increase in DeFi TVL and real-world assets, despite a drop in app revenue.\nOne of the fastest-growing segments for Solana was real-world assets. RWA value on Solana rose 124% year to date, and has reached $390 million. Leaders in this category remained Ondo Finance’s USDY, backed by U.S. Treasuries, and with a market cap of $175.3 million.\nFor one, Solana’s DeFi total value locked rose 124% over a yearly period, reaching $8.6 billion. This makes the Solana ecosystem the second-biggest after Ethereum (ETH). The leading protocol remains Jito Labs liquid staking platform, with $2,87 billion in TVL.\nSanctum, a newly launched liquid staking platform, managed to capture $2.18 billion in revenue just days after launch. Accompanying this rise was a significant increase in staked SOL, at $60 billion, a 25% QoQ increase. What is more, liquid staking penetration rose to 12%, with jitoSOL remaining in the lead.\nOn-chain revenue drops 44% QoQ\nDespite strong growth in DeFi TVL and staking, not all metrics were positive. Notably, apps registered 44% less revenue compared to the last quarter, falling to $576 million. The leader in revenue generation remains Pump.fun, with Axiom in the second place.\nDespite a fall in app revenue, the share of revenue captured by applications grew from 126.5% to 211.6%. Validator fees fell even less, partially due to the new Alpenglow consensus protocol, which cuts validator costs.", "authors": "Crypto News", "published": "2025-08-18T18:56:28Z", "url": "https://crypto.news/solana-rwas-grow-reach-390m-up-124-ytd-messari-report/", "source": "trafilatura"}
{"domain": "https://www.coindesk.com", "title": "Stress Test Briefly Hits 100K Transactions per Second, Boosting SOL Appeal", "text": "The data showed that Solana could theoretically sustain 80,000–100,000 TPS in real operations like transfers or oracle updates under peak conditions.", "authors": "CoinDesk", "published": "2025-08-18T07:54:34Z", "url": "https://www.coindesk.com/markets/2025/08/18/solana-briefly-hits-100k-tps-under-stress-load-boosting-sol-appeal", "source": "gnews_fallback", "error": "Failed to download"}
{"domain": "https://techbullion.com", "title": "Best Cryptos to Buy Now According to Analysts: Proven Reasons Why This Altcoin May Surpass Solana (SOL) in Growth", "text": "The debate about the best crypto coins to buy today often circles back to big names like Bitcoin, Ethereum, and Solana (SOL). Yet, analysts studying early-stage opportunities argue that the next big winner for investors looking for maximum ROI is Mutuum Finance (MUTM). The project is still in presale, but the fundamentals, utility, and momentum surrounding it are setting the stage for growth that could rival Solana (SOL)’s (SOL) earliest days.\nSolana (SOL)’s 10,000% Story and MUTM’s Parallel\nSolana (SOL) is one of the best-known examples of what happens when investors position themselves early in the right project. From its early days, it soared over 10,000% and created life-changing gains for its community. Analysts watching Mutuum Finance (MUTM) believe its trajectory could mirror that success, pointing to real use cases, advanced protocol design, and growing community support.\nTo show how early investors are already seeing results, consider this: a $8,000 ETH swap into MUTM at Phase 1 of the presale when tokens were just $0.01 now sits at $28,000 in Phase 6 where the price is $0.035. When the listing price hits $0.06, this single investment is set to be worth $48,000 on paper, locking in a 6x ROI in less than a year. This type of growth story is what analysts say separates Mutuum Finance (MUTM) from other crypto coins on the market.\nThe platform also introduces unique lending models, offering investors a chance to generate passive returns. In the peer-to-contract (P2C) example, a lender deposits 100 BNB worth $60,000 into the liquidity pool. With utilization standing at 72% and the protocol assigning a 14% APY, the yearly earnings total $8,400. This approach eliminates the need for borrower-to-borrower matching, ensuring consistent returns based on pool activity.\nBorrowers also benefit from flexibility. For instance, a user can put up $12,000 worth of LINK as collateral and instantly borrow $9,000 USDT at 75% loan-to-value. Unlike traditional finance, there’s no fixed term—they can repay anytime, as long as the collateral remains sufficient. This flexibility has strong appeal among crypto users looking for liquidity without losing their long-term positions.\nAnalysts See a Breakout Moment Ahead\nMutuum Finance (MUTM) is not just winning attention for its innovative financial mechanics; it is also gaining credibility with its rigorous approach to security and transparency. The project has been audited by CertiK, earning a 95 Token Scan score and a 78 Skynet rating, giving investors assurance in its technical robustness.\nCurrently, the presale is in Phase 6 at $0.035 per token. The community has already grown to over 15,400 holders, with more than 20% of tokens sold and over $14.6 million raised. A $50,000 bug bounty program ensures security remains a top priority, while a $100,000 giveaway is creating additional buzz around the presale. With Phase 7 approaching at $0.040, investors are feeling the urgency to act before the price climbs higher.\nWhat makes analysts more bullish is how this momentum lines up with the roadmap. The project’s beta launch is expected to go live at the same time as the token listing, providing instant utility for investors. Planned listings on major exchanges like Coinbase and KuCoin are projected to bring even more liquidity and exposure. Together, these developments have analysts predicting that Mutuum Finance (MUTM) could outperform Solana (SOL)’s early growth curve in the short term.\nFor many retail investors, the question often arises: is crypto a good investment during times of volatility? With headlines often focused on why crypto is down or warning about a crypto crash today, projects like Mutuum Finance (MUTM) stand out because they deliver tangible utility rather than just speculative hype. The combination of lending models, strong security, and buy-and-distribute tokenomics gives MUTM a foundation that sets it apart.\nWhile Solana (SOL)’s story is already written, Mutuum Finance (MUTM) is still unfolding. Analysts believe this is exactly the kind of entry point that can make investing in crypto transformative for those who act before wider market exposure takes hold.\nThe Bottom Line\nMutuum Finance (MUTM) is demonstrating all the hallmarks of an early-stage project with exponential growth potential. With a presale price of $0.035, a roadmap pointing toward immediate beta utility, and anticipated listings on major exchanges, analysts believe MUTM has the qualities to outpace many leading altcoins in the near term. For investors asking what crypto coins to buy now, experts are increasingly pointing to Mutuum Finance (MUTM) as the project poised to deliver the kind of ROI that once made Solana (SOL) a household name in crypto.\nFor more information about Mutuum Finance (MUTM) visit the links below:\nWebsite: https://www.mutuum.com\nLinktree: https://linktr.ee/mutuumfinance", "authors": "TechBullion", "published": "2025-08-18T17:46:28Z", "url": "https://techbullion.com/best-cryptos-to-buy-now-according-to-analysts-proven-reasons-why-this-altcoin-may-surpass-solana-sol-in-growth/", "source": "trafilatura"}
{"domain": "https://cointelegraph.com", "title": "SEC delays rulings on Truth Social, Solana and XRP ETFs to October", "text": "The SEC has extended deadlines for three major crypto ETFs, including Truth Social’s Bitcoin-Ethereum fund, Solana products from 21Shares and Bitwise, and the 21Shares Core XRP Trust, with rulings now due in October 2025.", "authors": "Cointelegraph", "published": "2025-08-18T21:25:54Z", "url": "https://cointelegraph.com/news/sec-pushes-back-decisions-truth-social-solana-xrp-crypto-etfs", "source": "gnews_fallback", "error": "Failed to download"}
{"domain": "https://crypto.news", "title": "Solana founder: Privacy is not a core factor of product-market fit", "text": "Solana founder: Privacy is not a core factor of product-market fit\nSolana Labs founder Toly, says that privacy alone does not make a crypto product or feature compelling enough to alter how users engage with it.\nIn a recent post, the Solana (SOL) founder contributed to a thread on X discussing the biggest hurdles facing the DeFi industry. He does not recognize privacy as a “killer feature” in that sense.\n“There is lack of pmf for privacy. In of itself it’s not a killer feature that would change user behavior,” said Toly in his post.\nIn this context, concepts such as privacy may have technical or ideological significance, but it doesn’t guarantee widespread adoption. For a feature to drive adoption, it must solve a tangible problem, offer clear utility, and encourage ongoing user engagement.\nAccording to Toly, privacy fails to meet these criteria on its own. It is not a standalone “killer feature” that fundamentally changes user behavior or adoption patterns when it comes to crypto projects.\nIn the discussion thread, the trader on X that started the discussion tried to counter Toly’s point by saying that privacy is still a pretty determining factor, considering there have been incidents on-chain where the system doesn’t hold up to technical attacks like the case of the Hyperliquid whale which triggered mass liquidation due to the sheer size of the perp.\n“Are there not cases where privacy is preferable for certain trades?” asked the trader.\n“No. Complaining about a problem doesn’t mean that that there is pmf for the solution,” said Toly.\nIn an earlier post, former Solana Head of Growth Matty Taylor suggested that the achieving PMF would involve other criteria that are based on features centered on more economic and utility, such as sustainable revenue, demand, and liquidity instead of privacy.\nHow does Solana’s privacy stack up against other chains?\nSolana offers native privacy features through its Token-2022 standard, which supports confidential transfers, encrypted balances, and optional auditor keys. However, these features are opt-in and require token migration.\nSolana also hosts early-stage privacy projects that employ zero-knowledge proofs, such as Elusiv, Arcium, and Light Protocol.\nCompared to other leading chains in privacy, Solana is pushing innovative native and app-layer privacy. However, it is still behind Ethereum (ETH) in terms of institution-grade privacy infrastructure and ecosystem maturity.\nEthereum doesn’t offer privacy at the base layer. Instead, it relies on a mature Layer 2 ecosystem zk-Rollups, zkEVMs, and protocols like Tornado Cash for privacy tooling.", "authors": "Crypto News", "published": "2025-08-18T12:13:23Z", "url": "https://crypto.news/solana-founder-privacy-is-not-a-core-factor-of-product-market-fit/", "source": "trafilatura"}
{"domain": "https://cryptoslate.com", "title": "Solana smashes 107,000 TPS milestone sparking questions about real world use", "text": "Solana smashes 107,000 TPS milestone sparking questions about real world use\nSolana’s record block pushes network capacity claims to new highs while leaving doubts over how quickly peak performance can reach everyday applications.\nSolana processed more than 100,000 transactions per second during a recent stress test, marking a new milestone in the network’s scaling efforts.\nThe mainnet block briefly peaked at 107,540 TPS through high-load “noop” program calls, according to data shared over the weekend, showing the upper bound of Solana’s current infrastructure.\nDevelopers clarified that the test did not involve real transfers or complex state changes, meaning the throughput figure reflects theoretical limits.\nCo-founder of Helius, Mert Mumtaz, explained that transactions such as transfers, Oracle updates, or similar operations could still reach 80,000 to 100,000 TPS in practice. This compares with Solana’s current day-to-day throughput of around 1,000 to 3,700 TPS, much of which comes from validator vote activity rather than user-initiated transactions.\nThe results contribute to a broader narrative around Solana’s technical capacity and ecosystem positioning. Firedancer, a validator client written in C and C++ by Jump Crypto, has already produced testnet benchmarks exceeding 1.2 million TPS, though it is not yet deployed on mainnet.\nFurther architectural changes, such as separating execution from consensus and introducing localized fee markets, are designed to allow applications to operate at scale while avoiding congestion events that have historically affected the chain.\nEarlier this summer, Firedancer test environments demonstrating throughput exceeding one million transactions per second put Solana on the radar of both government and corporate treasuries.\nAs previously reported, an executive order in March created a U.S. “Digital Asset Stockpile” funded by seized crypto, where Solana was cited in the broader strategic framework. Corporate treasuries have also begun shifting reserves into SOL, a trend aligning with the network’s ongoing performance milestones.\nThe 100,000 TPS figure adds a concrete benchmark to ongoing debates about throughput ceilings across competing Layer-1 platforms. Ethereum and Avalanche, which handle far lower throughput under load, have sought to scale through rollups and modular designs.\nSolana’s approach emphasizes single-chain performance and validator efficiency, a strategy that continues to shape its developer ecosystem. Bitwise, in a separate research note, pointed to stability during prior stress tests as an important factor in supporting infrastructure for use cases that demand high-frequency activity such as trading and gaming.\nFor developers, higher capacity opens pathways to previously impractical applications. Real-time gaming, decentralized order books, AI interactions, and on-chain auctions are examples of workloads that could benefit from throughput at the tested levels.\nSuch use cases have historically faced bottlenecks from chain congestion and fee spikes, conditions that Solana’s team is attempting to mitigate with client diversity and runtime optimizations.\nThe milestone arrives at a time of heightened attention toward altcoins. Reads across related markets have increased substantially, and performance-based narratives have been a key driver. The stress test outcome adds to this momentum, offering evidence of progress in an area where Solana has consistently differentiated itself.\nWhile the event highlights what is technically possible, sustained performance remains lower in practice and is subject to the complexities of real transaction execution. Vote inflation within current throughput numbers also complicates direct comparisons with user activity.\nFiredancer and other engineering efforts have not yet been fully integrated into mainnet, leaving questions around how quickly peak test throughput can translate into production-ready infrastructure.\nDespite these caveats, the 100,000 TPS benchmark sets a new reference point in Solana’s development and reinforces its push toward higher-capacity blockchain design.", "authors": "CryptoSlate", "published": "2025-08-18T08:50:55Z", "url": "https://cryptoslate.com/solana-smashes-107000-tps-milestone-sparking-questions-about-real-world-use/", "source": "trafilatura"}
{"domain": "https://techbullion.com", "title": "August Crypto Buzz Builds as Bitcoin Swift Outpaces Layer Brett and Ozak AI in Investor Watchlists", "text": "Layer Brett and Ozak AI are both gaining traction on investor watchlists. Layer Brett positions itself on Ethereum Layer 2 with fast confirmations, low fees, and community‑driven tokenomics typical of meme coins. Ozak AI aims directly at finance with predictive agents, real‑time data streams, and performance‑based rewards. Both are still early, with presale entry points designed to be accessible and roadmaps that promise utility beyond hype. Meanwhile, Bitcoin Swift (BTC3) is already turning early conviction into weekly cash‑flow style benefits through PoY rewards. One project is paying supporters now, and that is why BTC3 is quickly becoming the one to beat.\nFirst look at Layer Brett and Ozak AI\nLayer Brett leans into culture plus speed on an L2 stack, courting a broad retail base with low‑fee transfers and staking hooks that reward engagement. The value case rests on community growth, exchange reach, and whether it can sustain momentum once listings arrive. Ozak AI takes the opposite path: it is an AI‑powered platform for the markets, delivering access to AI models, live data, and utility inside DeFi. Its promise hinges on smooth integrations and whether predictive agents deliver measurable trading advantages.\nHere’s the pivot: both projects are promising, but they are still building toward utility. Bitcoin Swift is already distributing programmable yield at the end of every stage, which is why capital is rotating toward BTC3 today.\nBitcoin Swift: the AI‑powered financial operating system\nBTC3 is a modular ecosystem that combines programmable staking rewards (PoY), AI-powered smart contracts, decentralized identity, and zk-privacy into a single scalable stack. A hybrid security model with checkpoint finality every 100 blocks anchors reliability, while a USD-pegged stable token, BTC3E, is planned to utilize collateral vaults, AI oracles, and on-chain liquidation safeguards.\nBTC3 launches first on Solana for maximum efficiency: thousands of transactions per second, fees under 1 cent, and plug‑and‑play access to over 400 mature ecosystem projects. That means presale participants enjoy fast transfers, cheap participation, and a frictionless start before the trustless bridge to BTC3’s native chain.\nFor transparency and institutional readiness, Bitcoin Swift has undergone third‑party checks. Read the independent Cyberscope Audit, the Solidproof Audit, and the Spywolf Audit. Identity verification is also completed via KYC, aligning BTC3 with top‑tier listing standards.\nStay updated through the official Website and the project’s X, where stage progress, payouts, and announcements drop first.\nFinal 2 days of Stage 5, act while bonuses are live\n- Current Price: $5\n- Raised: $750,000+\n- Launch Price: $15\n- Stage 5 APY: 96% with more than $60,000 already paid in APY staking profits to users\n- Community: 2600+ users\nA referral bonus is active at 10% for both sides on each completed transaction.\nLimited‑time purchase bonuses before Stage 5 ends in 2 days:\n- Tier 1: Invest $100 – $1,999 → 10% Bonus Tokens\n- Tier 2: Invest $2,000 – $4,999 → 20% Bonus Tokens\n- Tier 3: Invest $5,000+ → 40% Bonus Tokens\nPoY rewards are distributed automatically at the end of each presale stage, giving early buyers instant protocol benefits. This is one of the shortest, most momentum-driven campaigns of the year, ending on September 18, 2025 —a 64-day sprint with about a month left after Stage 5 closes.\nInfluencers and community heat up the narrative\nCrypto voices are piling in with detailed breakdowns of why BTC3 is gaining attention. Recent coverage includes:\n- Crypto Sister on how programmable yield changes presale behavior.\n- Bull Run Angel on Solana speed, low fees, and stage‑by‑stage payouts.\n- Crypto Show on security, DID, and zk‑privacy.\n- Token Galaxy on APY, rapid sell‑through, and catalysts.\nAdding fuel to the fire, insider chatter suggests the team is already in discussions for listings with MEXC, KuCoin, and LBank. If these materialize, liquidity and discovery could accelerate dramatically.\nConclusion: strong contenders, but one pays today\nLayer Brett and Ozak AI each have credible stories and upside if they execute. However, Bitcoin Swift stands out for immediate, measurable buyer benefits, rigorous audits, Solana‑level speed, and a clear path to stablecoin‑powered utility. With Stage 5 down to the last 2 days and hefty tiered bonuses live, the most compelling move on many investor watchlists is clear.\nFor more information on Bitcoin Swift: Website", "authors": "TechBullion", "published": "2025-08-18T16:04:21Z", "url": "https://techbullion.com/august-crypto-buzz-builds-as-bitcoin-swift-outpaces-layer-brett-and-ozak-ai-in-investor-watchlists/", "source": "trafilatura"}
{"domain": "https://decrypt.co", "title": "Solana Handles 100K Transactions Per Second in Test Run: Here's Why It Matters", "text": "In brief\n- A Solana validator processed blocks with greater than 100,000 transactions per second in an experiment.\n- The performance improvement was more than 25x the typical throughput of the Solana mainnet.\n- Key Solana backers suggest that it means the network is ready for much more.\nThe Solana network briefly processed more than 100,000 transactions per second (TPS) in an on-chain experiment Sunday. That’s more than 25 times the network’s typical throughput, according to data gathered by the network’s explorer.\nSolana already massively outpaces O.G. blockchain networks like Bitcoin and Ethereum on that front, but the Sunday peak beats Visa's own high mark of handling up to 65,000 transactions per second.\nThe Solana validator operator behind the feat said that it showcases what’s possible if continued technical developments and efficiency improvements make their way to the popular layer-1 blockchain.\n“The main point I want to get across is that Solana needs more efficient programs and an efficient token standard,” pseudonymous validator Dr. Cavey PHD told Decrypt.\nCavey’s validator achieved a peak of 104,529 TPS on Sunday in what they called an experiment conducted on a “whim.”\nHowever, unlike a typical Solana block filled with transactions like token swaps or meme coin launches, the experimental blocks instead were filled with “votes, a few normal transactions, and a significant number of ‘no-op’ transactions,” or those that don’t require much computation.\nNevertheless, if extrapolated out and handled with more efficient programs and token standards, Cavey believes the network could process approximately 100,000 token transfers per second—or 10,000-20,000 swaps in its current state.\nWith such programs and token standards in place, they said, Solana can become the foundational infrastructure for on-chain markets that it aims to be.\n“High capacity enables the world’s markets to all be on-chain,” said Cavey. “Without the capacity, we can only ever hope to support a handful.”\nSolana’s real-time throughput is around 3,600 TPS at present time, according to the block explorer on Solana.com. For comparison, competing network Ethereum’s real-time mark is around 20.7 TPS, according to data from Etherscan—around 170 times slower than Solana.\nWhy is it so important that Solana can achieve 100,000 TPS?\n“It's important insofar as it demonstrates that the network can clearly scale over an order of magnitude more than the current utilization, which is already several orders of magnitude over most blockchains,” Multicoin Capital Managing Partner Kyle Samani told Decrypt. “It means that Solana is ready to support web-scale applications today.”\n“This enables more activity to come on-chain,” Mert Mumtax, CEO of Solana infrastructure firm Helius Labs, told Decrypt. “More finance, more oracle updates, more market-making, etc. And of course: lower fees for users.”\nDevelopers too stand to gain, according to Samani, who added that major throughput gains “opens up an entirely new design space for transaction-heavy applications.”\nIn July, a blog post authored by leading Solana stakeholders (including Samani) outlined a technical roadmap designed to make Solana the home of the world’s best financial markets, with improvements scheduled regularly for the next few years.\nBut according to Cavey, major throughput improvements like those showcased in their experiment could be here even sooner.\n“Three months at best,” the validator said, “six months at worst.”\nDaily Debrief Newsletter\nStart every day with the top news stories right now, plus original features, a podcast, videos and more.", "authors": "Decrypt", "published": "2025-08-18T21:43:19Z", "url": "https://decrypt.co/335705/solana-handles-100k-transactions-per-second-test-run", "source": "trafilatura"}
