{"domain": "https://u.today", "title": "Ethereum (ETH) Bull Market Over? Shiba Inu (SHIB) Risks Adding Zero Rocket, XRP's Last Level Before $2", "text": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\nEthereum has most likely entered a corrective phase, which could be the beginning of the end of the bull market. Ethereum has been gradually declining after reaching a peak of about $4,800, and the price action is displaying the first discernible signs of weakness since July.\nGiven that trading volume has decreased in comparison to earlier in the rally, the decline suggests that market momentum may be waning. Ethereum corrections following sharp rallies have historically tested important moving averages, and the 26-day EMA is currently the first crucial level to keep an eye on. A clean rebound prior to testing this zone would be a more convincing sign that buyers are still in control, but a drop toward this line would indicate a continuation of short-term selling pressure.\nThe larger bullish structure would hold up if ETH could bounce back above recent highs, rather than tagging the 26 EMA, indicating that this move is merely a brief cooling off. With the next layers of support located close to the 50 EMA and psychological round levels around $4,000, additional downside may become possible if the 26 EMA breaks decisively.\nThe more general question is whether the upward momentum of the cycle will end with this correction. Since long-term moving averages are still sloping upward, and Ethereum is currently trading comfortably above key support lines, it appears that the bull market is still going strong. But as Ethereum continues to decline, traders may grow increasingly wary, particularly as the market closes out derivative positions.\nShiba Inu at risk\nShiba Inu is once again close to adding a zero to its price. Following weeks of consolidation within an ascending triangle pattern, SHIB is currently close to losing the lower range, which could lead to more severe declines.\nThe failure of SHIB to produce significant upward momentum is seen clearly on the daily chart. The token is continuing to retest the support line, rather than breaking higher, which indicates a weakening setup, even though the ascending triangle formation typically leans bullish. With today’s rejection, the likelihood of a breakdown is gradually increasing, and each bounce has been weaker than the one before.\nDue to the absence of strong support zones until much lower levels, the move may accelerate rapidly, if SHIB breaks below the triangle’s support. SHIB would most likely be forced to add another zero to its price as a result of such a decline, returning it to valuations not seen since the early summer.\nLower trading volumes and the absence of whale-driven support both increase the descending momentum and lessen the likelihood of a recovery. The risk is increased by the fact that SHIB’s performance is still trailing, leading cryptocurrencies like Ethereum and Bitcoin, which have at least maintained stronger trends.\nXRP checks in\nXRP is not feeling that well, as the asset is close to entering a critical state. The token is currently declining and in danger of breaking below its 50-day exponential moving average (EMA) after failing to maintain momentum above $3. Although this level has historically been used as a temporary buffer, the current situation indicates that it might not last for very long.\nAs XRP records a string of red candles, the market’s inability to maintain bullish sentiment is putting pressure on the 50 EMA. The next strong support is located much deeper in the $2.70-$2.75 range, and the $2.40 region, which is anchored by the 200 EMA if this level fails. A breakdown of this kind would wipe out most of XRP’s recent gains and expose the token to a possible retest nearer $2.00, a psychological level that will decide whether the larger bullish cycle holds up.\nCuriously, volume data presents a somewhat different picture, even though price action appears fragile. Indicating that bears are not fully committing to the sell-off, trading volumes have been continuously dropping during the downward move. This lack of conviction allows for a potential rebound, but XRP runs the risk of crashing lower toward significant support levels in the absence of an abrupt spike in demand.\nXRP needs to regain the $3.00 mark with significant buying pressure if bulls wish to regain control. If this is not done, there may be a chance for a more severe correction, with $2.00 acting as the final key level before sentiment turns sharply against the asset.", "authors": "U.Today", "published": "2025-08-19T00:01:00Z", "url": "https://u.today/ethereum-eth-bull-market-over-shiba-inu-shib-risks-adding-zero-rocket-xrps-last-level-before-2", "source": "trafilatura"}
{"domain": "https://www.benzinga.com", "title": "Bitcoin, Ethereum, Dogecoin, XRP Slide As Crypto Liquidations Top $500 Million: Analyst Says This Is What Is In Store For BTC In The Current Quarter", "text": "Leading cryptocurrencies fell further, while stocks barely changed on Monday as investors trimmed risk appetite.\n| Cryptocurrency | Gains +/- | Price (Recorded at 9:20 p.m. ET) |\n|---|---|---|\n| Bitcoin BTC/USD | -0.81% | $116,487.79 |\n| Ethereum ETH/USD | -2.77% | $4,339.70 |\n| XRP XRP/USD | -0.15% | $3.07 |\n| Solana SOL/USD | -2.50% | $185.09 |\n| Dogecoin DOGE/USD | -3.37% | $0.2244 |\nMore Than $400 Million In Longs Liquidated\nBitcoin sank below $115,000 early morning but recovered to above $117,000 by evening. Trading volume jumped nearly 50% over the last 24 hours.\nEthereum also rebounded to $4,400, but the rally could not be sustained, pushing the coin back to the early $4,300s overnight. XRP and Solana fell 0.15% and 2.50%, respectively.\nETH's dominance rose to 13.3%, while Bitcoin's market share dropped below 59%.\nOver $535 million was liquidated from the market over the last 24 hours, with long positions accounting for $436 million. Around $422 million in BTC longs risk liquidation if the coin slips below $114,000.\nBitcoin's open interest fell 1.24% over the last 24 hours. Meanwhile, over 57% of Binance traders with open BTC positions were betting in favor of the coin's rally.\nThe \"Greed\" sentiment dropped further to 56, according to the Crypto Fear & Greed Index, signaling an increase in selling pressure.\nTop Gainers (24 Hours)\n| Cryptocurrency | Gains +/- | Price (Recorded at 9:20 p.m. ET) |\n|---|---|---|\n| AB (AB) | +7.52% | $0.009614 |\n| OKB (OKB) | +5.27% | $123.01 |\n| POL (POL) | +3.18% | $0.2559 |\nThe global cryptocurrency market capitalization stood at $4.02 trillion, following a decline of 3.87% in the last 24 hours.\nAll Eyes On Jerome Powell\nStocks were little changed on Monday. The Dow Jones Industrial Average fell 34.30 points, or 0.08%, to close at 44,911.82. The S&P 500 dipped 0.01% to close at 6,449.15. The Nasdaq Composite was the outlier, closing up 0.03% at 21,629.77.\nInvestors are looking forward to Federal Reserve Chair Jerome Powell’s speech at the Jackson Hole Economic Policy Symposium on Friday for signals on monetary policy.\nTraders are pricing in an 83% chance that the central bank cuts interest rates at its September meeting, according to the CME FedWatch tool.\nWill Whale Accumulation Power Bitcoin Up?\nOn-chain analytics firm Santiment stated that Bitcoin whales have been accumulating since the dip from last week's all-time high.\n\"With prices -6.22% since August 13th, wallets with 10-10,000 BTC have accumulated 20,061 more coins,\" Santiment added.\nThe firm indicated a \"notable correlation\" between the cohort's holdings and BTC's future price movement.\nWidely followed cryptocurrency analyst BitBull highlighted the \"worst case scenario\" for the apex cryptocurrency\n\"It’ll continue to consolidate between $112,000-$120,000 in Q3, while alts will head higher. We could even see a capitulation wick below $112,000, just like we had a pump above $124,000,\" the analyst projected.\nPhoto Courtesy: Volodymyr Maksymchuk on Shutterstock.com\nRead Next:\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "authors": "Benzinga", "published": "2025-08-19T02:06:30Z", "url": "https://www.benzinga.com/crypto/cryptocurrency/25/08/47200095/bitcoin-ethereum-dogecoin-xrp-slide-as-crypto-liquidations-top-500-million-analyst-says-this-is-what-is-in-store-for-btc-in-the-current-quarter", "source": "trafilatura"}
{"domain": "https://decrypt.co", "title": "SEC Punts on Trump Media Bitcoin and Ethereum ETF Decision, Plus XRP and Dogecoin Funds", "text": "In brief\n- The SEC will decide on the Truth Social Bitcoin and Ethereum ETF on October 8, likely after a rules change request from two exchanges that could shorten approval processes.\n- The agency delayed decisions on XRP funds from Grayscale, Bitwise, CoinShares, Canary Capital, and 21Shares.\n- It also pushed back deadlines on separate Dogecoin and Litecoin ETFs, and a proposal to add staking to an existing spot Ethereum ETF.\nThe U.S. Securities and Exchange Commission has delayed its decisions on an exchange-traded fund proposed by Donald Trump's media and technology company to track the performance of Bitcoin and Ethereum and seven other ETFs based on single digital assets.\nIn a filing Monday, the regulator said that it moved its deadline back 45 days for weighing in on the Truth Social Bitcoin and Ethereum ETF to October 8.\nIt announced identical delays for applications filed for spot XRP funds by Grayscale, CoinShares, Canary Capital, Bitwise and 21Shares, a spot Dogecoin ETF from Grayscale, and a spot Litecoin product from CoinShares, although the dates for potential approvals of those funds vary.\nIt also held up resolving a request to add staking to the the 21Shares Core Ethereum ETF, which tracks the price of the second-largest cryptocurrency by market value.\nThe delays comes four days after the agency delayed decisions on Solana ETFs from Bitwise, 21Shares, and VanEck, and a Dogecoin fund from 21Shares.\nThe SEC is weighing a wave of proposals tracking cryptocurrencies. Those submissions have resulted from the dramatic success of 11 spot Bitcoin and nine Ethereum ETFs, a more favorable political environment for cryptocurrencies ushered in by the Trump administration, and growing interest by traditional finance giants who were formerly resistant to the asset.\nThe filings also follow roughly three weeks after two major U.S. exchanges asked the SEC to approve amendments that could significantly shorten the approval process for future crypto exchange-traded funds, automatically listing certain products without requiring case-by-case filings.\nIn separate filings, Cboe BZX and NYSE Arca requested changes to their listing standards that would allow certain crypto ETFs to be listed without enduring the SEC's rigorous evaluation under Rule 19b-4, a process that requires exchanges to submit proposed rule changes. Under current guidelines, such reviews of proposed changes to funds could take 240 days.\nBloomberg Senior ETF Analyst Eric Balchunas told Decrypt that the SEC's filings Monday were \"nothing significant,\" and were likely timed to follow a probable SEC green light of Cboe and NYSE's amendments next month following the conclusion of a comments period.\n\"Even though it feels like 'Isn't this SEC supposed to approve all this stuff?', the listing standards are out for comment,\" Balchunas said. \"So just in the nick of time, these listing standards should be approved. And then we're anticipating a batch of approvals based on the listing standard starting in October.\"\n\"So this delay feels discouraging, but it's just a little more patience,\" he added. \"It'll all happen soon.\"", "authors": "Decrypt", "published": "2025-08-19T01:31:04Z", "url": "https://decrypt.co/335695/sec-punts-trump-media-bitcoin-ethereum-etf-decision-xrp-dogecoin", "source": "trafilatura"}
{"domain": "https://coingape.com", "title": "October Could Be a Make-or-Break Month for Ripple- Lawyer Amid XRP ETF and Banking License Decision", "text": "Highlights\n- Lawyer Bill Morgan shares that October could be a make-or-break month for Ripple’s growth.\n- This came after the SEC delayed XRP ETF applications from major issuers like Grayscale, 21Shares, and Franklin Templeton.\n- Ripple now awaits two major regulatory decisions: XRP ETF approvals and a U.S. national banking license.\nCrypto Lawyer Bill Morgan shared that October 2025 is an essential month for Ripple, as the company faces two landmark decisions. This comes after the U.S.SEC pushed back rulings on multiple XRP ETF applications.\nWhy October Key for Ripple\nIn a recent post, Bill Morgan shared that October could play a huge role in XRP’s growth. This followed the SEC’s recent decision to push back the decision date for various XRP ETF applications. He also highlighted that Ripple’s banking license decision could fall in October.\n“All these spot ETFs including XRP spot ETFs being delayed until late October 2025. Then you have Ripple’s application for a national bank charter… which means by the end of October. A lot could happen at once in October,” he noted.\nWhile much of Ripple’s business plan remains confidential, the outcome of these pending approvals will carry enormous weight. An XRP ETF would signal market validation, while a national charter would anchor Ripple’s operations within the U.S. financial system.\nNow that the SEC-Ripple lawsuit is over, the business is getting closer to mainstream integration and improved regulatory clarity. The token would advance significantly if the XRP ETFs were approved.\nKey Regulatory Decisions Expected in October\nAs CoinGape reported, the SEC formally extended the review period for several XRP ETF applications. This included filings from 21Shares, Grayscale, Bitwise, CoinShares, Canary Capital, WisdomTree, and Franklin Templeton.\nInitially due in August, the commission shifted deadlines by 60 days, setting mid-to-late October as the final window for decisions. According to regulatory timelines, the SEC cannot issue any further extensions beyond this point. This means the ETFs will likely get a final decision by October.\nInstitutional investors would have regulated exposure to the altcoin if the XRP ETF were approved. This might result in increased liquidity and adoption. Ripple’s attempts to incorporate its ecosystem with traditional financial markets, on the other hand, would be hampered by rejection.\nAdding further weight to October, Ripple’s application for a U.S. national banking license is also expected to be decided by then. According to the Office of the Comptroller of the Currency’s (OCC) guidelines, applications are generally reviewed within 120 days, putting Ripple’s deadline around late October.\nThe charter would allow Ripple to operate as a federally regulated trust bank. This places it among a select group of crypto firms that have secured this level of oversight. The move would also elevate Ripple’s regulatory credibility. The firm also applied for a Federal Reserve master account, which would enable RLUSD reserves to be held directly with the U.S. central bank.\nRipple is at a turning point in the regulatory decision-making process as October draws near. The month may decide whether XRP gains a firmer foothold in the American financial system.\n- October Could Be a Make-or-Break Month for Ripple- Lawyer Amid XRP ETF and Banking License Decision\n- Chamath Palihapitiya Files $250M SPAC Aiming at America’s Strategic Tech Sectors\n- U.S. Treasury Seeks Public Input on GENIUS Act Stablecoin Rules\n- Breaking: SEC Postpones Decision On XRP ETFs, Along With DOGE and LTC Funds\n- Breaking: SEC Delays Decision on Trump’s Truth Social Bitcoin and Ethereum ETF\n- Ethereum Price Prediction as Profit-Taking Dominates ETH Market—Is a Bearish Breakdown to $4K Ahead?\n- Pi Coin Price Prediction: Analyst Eyes $0.50 as Mainnet Migration Intensifies\n- Cardano Price Forecast: Analyst Eyes $1.10 Despite Crypto Crash as Futures Volume Soars and ETF Odds Hit 82%\n- Popular Analyst Sees XRP Price Surge After Forming “Too Perfect” Pattern\n- Shiba Inu Price Targets $0.000026 Amid 4.7M Token Burn and Shibarium Security Boost", "authors": "CoinGape", "published": "2025-08-19T05:36:40Z", "url": "https://coingape.com/october-could-be-a-make-or-break-month-for-ripple-lawyer-amid-xrp-etf-and-banking-license-decision/", "source": "trafilatura"}
{"domain": "https://u.today", "title": "Ripple’s $606 Million XRP Transfer Sparks Hopes of Price Reversal", "text": "San Francisco-based blockchain company Ripple has stirred speculations with a mysterious transfer involving millions of XRP. On August 18, on-chain tracking platform Whale Alert spotted a major transfer from Ripple involving 200,000,000 XRP.\nAccording to the data provider, Ripple had moved a mega amount of XRP to an unknown address. The transfer was worth over $606 million per XRP’s price at the time the transfer was executed.\nRipple's mysterious transfer sparks reactions\nThe massive XRP transfer from Ripple has sparked reactions across the community as the destination of the transferred assets remained anonymous.\nAlthough the transfer comes as a little bit of a surprise, Ripple is known for making large XRP transfers at intervals, usually a few times every month.\nWhile market watchers have been closely monitoring on-chain moves like this, they have expressed curiosity as to whether the move could be the firm preparing for institutional deals or probably redistributing its reserves.\nWith the move coming amid a broad crypto market bloodbath, investors fear that the move might be Ripple preparing to dump its holdings ahead of deeper price declines.\nFollowing the anonymous nature of Ripple’s giant move on XRP today, the lack of clarity on the destination of the transfer has fueled discussions about whether it could be tied to upcoming private accumulation which may be bullish for XRP’s potential price.\nXRP returns above $3.06\nAfter days of trading sideways, XRP appears to be retracing back to its previous support level as its price returns above $3.\nOver the past days, the broad crypto market has been faced with a massive price bloodbath that saw the price of XRP fall as low as $2.9513 during the early hours of August 18.\nAlthough the massive XRP decline experienced over the last 24 hours has seen short-term holders suffer massive losses, data from crypto analytics platforms shows that up to 94% of XRP’s circulating supply is in profit. This suggests that the XRP ecosystem is dominated by long-term holders with solid faith in the asset’s future potential.\nFollowing the massive XRP transfer made by Ripple today, XRP appears to be forming a decent rebound as its price surges and holds steady at $3.07 as of press time.\nWhile data from CoinMarketCap shows that the asset has plunged below $2.96 on the same day, investors' hopes for a potential price breakout appear unshaken.", "authors": "U.Today", "published": "2025-08-18T19:31:46Z", "url": "https://u.today/ripples-606-million-xrp-transfer-sparks-hopes-of-price-reversal", "source": "trafilatura"}
{"domain": "https://cointelegraph.com", "title": "SEC delays rulings on Truth Social, Solana and XRP ETFs to October", "text": "The SEC has extended deadlines for three major crypto ETFs, including Truth Social’s Bitcoin-Ethereum fund, Solana products from 21Shares and Bitwise, and the 21Shares Core XRP Trust, with rulings now due in October 2025.", "authors": "Cointelegraph", "published": "2025-08-18T21:25:54Z", "url": "https://cointelegraph.com/news/sec-pushes-back-decisions-truth-social-solana-xrp-crypto-etfs", "source": "gnews_fallback", "error": "Failed to download"}
{"domain": "https://u.today", "title": "Peter Brandt Predicts $500K Bitcoin, 1.7 Billion XRP Accumulated at Make-or-Break Level, 10 Trillion Shiba Inu Massive Comeback - Crypto News Digest", "text": "XRP supply density highlights key levels\nXRP traders eyeing this key level after whales accumulate 1.7 billion tokens.\n- Key support. $2.81 level with over 1.7 billion XRP accumulated.\nThe $2.81 level currently serves as the key support for the XRP token, according to Glassnode data. Roughly 1.7 billion tokens have been accumulated at that level. Why supply density matters The analysis is based on the XRP cost basis distribution heatmap from Glassnode, which shows at which specific level holders accumulated their tokens.\n- Why it matters. High supply density means stronger support/resistance zones.\nGlassnode claims that this visualization provides a clearer view of the correlation between specific price levels and accumulated supply density. Such data can be useful for identifying potential support and resistance levels.\nThe heatmap shows that another major supply cluster is located at the $3.26 level. More than 1.05 billion tokens had been accumulated at the above-mentioned level. For comparison, a mere 2.9 million tokens have been accumulated in the $3.57-$3.58 range, Glassnode data shows.\nPeter Brandt issues $500K Bitcoin forecast\nPeter Brandt sees Bitcoin eventually reaching $500,000.\n- Short-term risk. Brandt sees BTC possibly plunging to $60,000 by Nov 2026 before any moonshot rally.\nPeter Brandt, one of the most famous cryptocurrency traders, has predicted that the price of Bitcoin (BTC) could potentially soar to the pie-in-the-sky $500,000 level. However, before this happens, Bitcoin might plunge to as low as $60,000, Brandt predicts by November 2026.\n- Cycle peak chance. He assigns a 30% probability that Bitcoin already topped this cycle at $124,517.\nBrandt believes that there is roughly a 30% chance that Bitcoin has already reached the peak of the current cycle. \"Dear readers, I am a Bayesian and must always consider binary narratives even if they oppose my personal viewpoints and hodlings. This is how I have survived five decades of commodity trading,\" Brandt explained.\nShiba Inu heavy whale moves but technical headwinds\nShiba Inu's comeback potential is still there as on-chain volumes stay in adequate range.\n- Massive transfer spike. SHIB saw 10 trillion tokens moved in a single day — a major jump in network activity.\nIn a single day, Shiba Inu recorded an incredible on-chain transfer volume of over 10 trillion tokens, showing that network activity has picked up speed following weeks of inactivity. Alongside this increase in transfer volume, Etherscan data indicates that the number of transactions remained stable at about 5,400, indicating that whale-sized movements rather than retail flows were the main driver.\n- Price action. Trading near $0.00001300, SHIB is consolidating inside a converging triangle pattern.\nSHIB is currently trading close to the $0.00001300 level as it attempts to level off following its recent erratic performance. As it presses against several technical resistances that have limited upside momentum, the asset is trapped inside a convergent triangle structure.\nThe 26 EMA, which SHIB has had difficulty holding above in recent weeks, is the first source of resistance. The 50 EMA, which is located just above the market, serves as a recurrent rejection zone. The technical pressure is further increased above that by the addition of a ceiling by the 100 EMA. The descending trendline, a structural resistance that has continuously pushed the price lower, is the fourth barrier.", "authors": "U.Today", "published": "2025-08-18T21:00:00Z", "url": "https://u.today/peter-brandt-predicts-500k-bitcoin-17-billion-xrp-accumulated-at-make-or-break-level-10-trillion", "source": "trafilatura"}
{"domain": "https://www.benzinga.com", "title": "Bitcoin, Ethereum, XRP Headed For September Crash? Watch Out, Analyst Warns", "text": "- Benjamin Cowen predicts Bitcoin will retest its bull market support band at $110K–$115K in September.\n- Ethereum could first notch a new all-time high before falling 20–30%, while altcoins may drop 30–50%.\n- Get the exact trades and sectors to target before August’s biggest earnings-driven market moves. Details here →\nProminent analyst Benjamin Cowen predicts a correction for Bitcoin BTC/USD, Ethereum ETH/USD and altcoins in September.\nWhat Happened: In a podcast on Aug., Cowen warned of a steep September correction across digital assets, citing historical post-halving patterns where July–August strength often flips into September weakness.\nHe drew parallels to 2013, 2017, and 2021, when Bitcoin corrected sharply after summer rallies.\nCowen expects Bitcoin, which peaked near $124,000 this cycle, to mirror the 2020 run-up when $12,400 marked a temporary high.\nHe said BTC has been \"basically flat since early July,\" with price action echoing prior cycles.\nAccording to him, Bitcoin now has \"a date with the 20-week SMA or 21-week EMA\" taking it close to its bull market support band of $110,000–$115,000.\nOn Ethereum, Cowen sees a brief push to new all-time highs before Bitcoin turns lower, after which ETH could tumble 20–30%. He added that altcoins will suffer deeper 30–50% drawdowns, as liquidity rotates back into BTC dominance.\nAlso Read: Bitcoin, Ethereum ETFs Diverge As ETH Takes The Lead BlackRock’s IBIT Shines\nWhat's Next: Cowen flagged macro risks, warning the Fed's likely September rate cut could spark higher bond yields, just as in 2023, accelerating the selloff.\nHe noted recent PPI data shows inflation \"running hotter than expected,\" further pressuring markets.\nWhen the Fed cuts more than likely in September, there’s a really good chance that the 10-year yield will likely go up. This mirrors September 2023 when Fed cuts \"basically marked a low for the 10-year yield.\"\n- Bitcoin: ~6% drop to support.\n- Ethereum: 20–30% decline after topping.\n- Altcoins: 30–50% crash.\nRead Next:\nImage: Shutterstock\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "authors": "Benzinga", "published": "2025-08-18T19:20:51Z", "url": "https://www.benzinga.com/crypto/cryptocurrency/25/08/47194917/bitcoin-ethereum-xrp-headed-for-september-crash-watch-out-analyst-warns", "source": "trafilatura"}
{"domain": "https://www.benzinga.com", "title": "Bitcoin, Ethereum, XRP, Dogecoin Continue Slide Lower", "text": "- Global cryptocurrency market capitalization dips 1.9% to $3.9 trillion.\n- Trader notes Bitcoin’s key short-term level to reclaim is around $117.5K, while another highlights the $114K–$116K zone as key area.\n- Get more market-moving news first with AI-powered analysis that turns noise into opportunity.\nCryptocurrency markets are trading lower on Monday, with analysts fearing a further slide in prices.\n| Cryptocurrency | Ticker | Price |\n| Bitcoin | BTC/USD | $116,355.23 |\n| Ethereum | ETH/USD | $4,369.60 |\n| Solana | SOL/USD | $183.81 |\n| XRP | XRP/USD | $3.07 |\n| Dogecoin | DOGE/USD | $0.2239 |\n| Shiba Inu | SHIB/USD | $0.00001275 |\nNotable Statistics:\n- Coinglass data shows 124,371 traders were liquidated in the past 24 hours for $530.47 million.\n- SoSoValue data shows net outflows of $14.1 million from spot Bitcoin ETFs on Wednesday. Spot Ethereum ETFs saw net outflows of $59.3 million.\n- The top losers in the past 24 hours include Pump.fun PUMP/USD, Sky SKY/USD and Virtuals Protocol VIRTUAL/USD.\nNotable Developments:\n- BitMine’s Crypto Holdings Surpass 1.52 Million ETH To Become Second-Biggest Crypto Treasury\n- Tom Lee’s $5 Billion Ethereum Bet Puts Bitcoin Maximalists On Notice\n- Strategy’s Bitcoin Stash Hits 629,376 BTC—More Than Tesla, Coinbase, Marathon Digital Combined\n- Bitcoin, Ethereum ETFs Diverge As ETH Takes The Lead BlackRock’s IBIT Shines\n- Circle-Backed Company’s Yen Stablecoin Nears Official Approval In Japan: Report\n- Shiba Inu Coin Teams Up For K-Pop Festival With Squid Game Challenges And Top Korean Rap Stars\nTrader Notes: Bob Loukas highlighted that Bitcoin failed to break its all-time highs late in the weekly cycle, likely peaking around Week 18.\nHowever, a swift recovery could still alter that outcome.\nDespite the short-term setback, the broader four-year cycle remains bullish, with upside surprises still possible.\nMeanwhile, altcoins are showing strength as Bitcoin dominance declines, signaling typical late-stage cycle behavior.\nMore Crypto Online noted that Bitcoin's focus remains on whether wave 2 has completed.\nWhile it's too early to confirm, a decisive break above the yellow trendline would serve as the first indication that wave 2 may have bottomed.\nDaan Crypto Trades observed that Bitcoin recently retested the 0.786 Fibonacci retracement level, historically a strong reaction point in this cycle.\nThe larger trading range has held steady over the past six weeks.\nIn the short-term, reclaiming $117,500 would be crucial to moving back above the 4-hour 200MA and EMA.\nCrediBULL Crypto added that Bitcoin has tested the expected range lows as anticipated.\nIf this marks the local bottom, sideways price action within the range could follow before a stronger upward move.\nThe $114,000–$116,000 zone remains the key area of interest, while a push above $120,000 would help confirm this as a local bottom. The strength and nature of the next move, impulsive or corrective, will indicate which scenario is playing out.\nRead Next:\nImage: Shutterstock\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "authors": "Benzinga", "published": "2025-08-18T19:51:25Z", "url": "https://www.benzinga.com/crypto/cryptocurrency/25/08/47195513/bitcoin-ethereum-xrp-dogecoin-continue-slide-lower", "source": "trafilatura"}
{"domain": "https://finbold.com", "title": "Ripple just moved over $600 million XRP; Incoming sell-off?", "text": "Ripple has executed a massive transaction outside its normal monthly XRP unlocks, a move likely to cause jitters among investors.\nSpecifically, the blockchain firm transferred 200 million XRP, valued at roughly $606 million, to an unknown wallet, according to data shared by Whale Alert on August 18.\nThe move comes as XRP briefly slipped below the $3 mark, sparking concerns of short-term selling pressure.\nMarket watchers are divided on the implications. Some suggest the transfer may be linked to Ripple’s On-Demand Liquidity (ODL) operations or preparations for institutional deals, pointing to a tactical reshuffling of reserves rather than an outright sell-off.\nOthers, however, fear it could signal an impending wave of selling from Ripple itself, a company long scrutinized for its management of XRP supply.\nThe transaction arrives amid heightened sensitivity around whale movements in the crypto market, particularly when tied to Ripple, with speculation swirling about potential exchange-traded funds (ETFs) and broader institutional adoption.\nXRP price analysis\nIf the tokens are sold, it could trigger a sharp sell-off for XRP, which is struggling to hold the $3 support zone amid wider cryptocurrency market weakness.\nAs of press time, XRP was trading at $3.06, down 0.45% in the last 24 hours and more than 4% lower over the past week.\nTechnically, XRP sits in a precarious position, hovering just above its 50-day simple moving average (SMA) of $2.95, which signals short-term bullish momentum.\nHowever, the much lower 200-day SMA at $1.93 underscores that the broader trend remains weaker, leaving the current rally vulnerable unless XRP can sustain above the 50-day average.\nMeanwhile, the 14-day RSI reads 51, a neutral level that suggests neither overbought nor oversold conditions, reflecting balanced market momentum.\nFeatured image via Shutterstock", "authors": "Finbold", "published": "2025-08-18T19:15:31Z", "url": "https://finbold.com/ripple-just-moved-over-600-million-xrp-incoming-sell-off/", "source": "trafilatura"}
